{"data":[{"approved_at_utc":null,"subreddit":"augmentedreality","selftext":" Okay? If you are into coding and understand what I mean then you could make a lot of money. I don't have much money, but I don't care because I just want to see changes in this world. I assume that even today this is quite possible - not exactly photorealistic, but I will tell you about my dumb idea. I know that some of you won't like, if, if you just want to play with a mouse+keyboard or with a console, but it's still a good idea and if a person who reads this is into coding and understands the concepts then he\/she should or might be able to start a company to make this game a reality.\n\nFirst of all it needs that a 3D map is made out of the actual world. It could be done with something like Meta Quest 3, etc. in the streets instead of apartments creating a 3D map that is sent to the cloud or some kind of servers and from such the 3D map could exist. Another way could be AI and how you could at some point have AI which could understand what is a wall and what is the street and then you could make a kinda simplified map. I'm not that good in this, but this is just an idea and I try to convince you of this?\n\nWhen you have a 3D map of the actual world then you can put all kinds of items and objects from videos games, movies, etc. inside of it. Let's just think this in terms of World of Warcraft, Overwatch, Borderlands, etc. in the actual world. I mean that there could be basic mobs and there could be also world events, bosses, etc. Possibly there could also be raids. I mean that you could go to a stadium and then collaborate with your guild, clan, etc. to defeat the hardest bosses by also then gaining the best loots in the game or at least good loot. But the thing is that you could put anything into the 3D map.\n\nI mean with the Overwatch that you could pick a class in the game. You could be a sniper or you could be an engineer with a turret. Of course you couldn't do everything exact to something like Overwatch because tanks would move at your own speed, but it's possible to use imagination. There could be a class that has a shield and also when a group is within the boundaries they could heal or get a damage boost. There could be the turrets. There could be a grenadier, etc. and some kind of cowboy or a person with a bow. I mean different kinds of classes.\n\nAnd what comes to World of Warcraft and Borderlands. I mean that you would get constantly upgrading loot. But the thing would be that you could sell and trade them to others. I would think that the company or industry who would do this would probably take percentages by each trade, buy, sell, etc., but it could be just 5 % or something. Also the loot would be so that when you destroy the loot then you get materials, so that every single item that would come in the game could have a material to be sold in an auction house, etc.\n\nBut the reason why to go into this path is that think about it? Pokemon Go was released and it was downloaded 1 billion times. It probably wasn't by 1 billion people, but think about it? If a person or a group would make this game - and I think that it's like Thanos, quite inevitable - then let's assume that like in FIFA there is the HUT and you could purchase chests for around 1 € to 10 €. If there was 100 million people who would buy items of that amount 10 € a week then it would mean 4 billion euros or dollars in a month. Of course there could be more players and there are the trades, but it could be roughly around 50 billion to 200 billion euros or dollars a year of profit?\n\nStill the reason for me is this? Let's think that you would play the game and could get 20 items in an hour. Let's say that 3 of them would be 1 € and rest would be 0,10 €. That would mean around 5 € in an hour. In Europe, like in Berlin you can get your own room in an hostel for 20 € a night and that would mean that you would have to play for 4 hours to have a room. There also costs a beer 0,5 l around 0,40 € and you could get a lot of them in one hour. You could also eat and at the same time you could always get an item that costs 10-1000 €. I mean that when homeless people would have the gear then they would manage?\n\nIt's just that in capitalism it doesn't mean that much what you do, but that you do something. Most of the work in this world isn't actually productive, but I won't go too much into that. In the end I just want to tell that the 3D map is certain to come. It's about art, it could be about robots interacting through a virtual environment to this one by different means. And I would predict that many people would actually want to play a game which they wouldn't spend money without the possibility of gaining money.\n\nOf course people who work could buy chests, etc. or items from others and gain loot faster, but this is just my concept of an AR game. Also depending how it's done then you could play also different kinds of games within it. I like the concept of a game I call \"Turf Wars\". You get from your neighborhood a suburb and then different suburbs try to take control over others. But the thing is that this could have implications like why to be in gangs when you could play a game and earn a bit of money? Of course people would probably still sell dope, but that isn't that bad?\n\nOkay? I should end this, but I would assume that something like this is inevitable and as a stupid ending I could write that I see a world where people interact with each other. Not in a virtual world, but like when you are having a coffee and look upon a woman and through your glasses - put a like - then a woman there could put a like and you could share a cup of coffee quite easily. But I don't even have a clue what the world will be in ten years from now with artificial intelligence and by artificial general intelligence, but I think that there are capabilities for this already and it would be quite good to make a program or an app that would start to make a 3D map out of the world. It doesn't have to be that detailed, but I drank couple of beers? So, please don't attack this writing and if you like it then there could come a person who can do it. I'm not interested about the wealth because it's inevitable, so why should I get something from what I didn't participate it and only just wrote what the future could behold?\n\n\\-----\n\nOkay? I read it through - could be some mistakes because I'm from Finland, but the thing is that the 3D map would be the concept and anyone could do any kind of games within it. It could be that Roblox will do this or then it could be Epic. Maybe NVIDIA will start to go towards this and they could test robots in virtual environments to act in the actual world through the 3D map. It could be that ChatGPT comes so advanced in couple of years that you could ask it to make a 3D map through videos and pictures. And yes! I believe that people wouldn't play games where it would cost 500 € a month to progress, or some could do such, but nothing like Diablo: Immortal, etc.\n\n\\-----\n\nRemembered what I was on about? I don't know does DLSS work this way, but I watched a documentary where there was that we have a very poor vision and our brain decode the environment to UHD. There could even come photorealism if there was a chip that could do such and from 1080p or less there could be made an upgrade to the experience, but this is all and if people want to see this as a reality faster and make big bucks themselves then why not, but I don't know how to code, but it would be interested to see what happens? And it's Ready Player One, but with people interacting like there could come Megatron as an event to a town square and have hundreds of people shooting it and his minions, etc. Maybe in five to ten years?\n\n\\-----\n\nSorry, but this is just my little brain child, but it could be also done that certain items like green or some other colour could only be got by doing deeds like helping the elderly, etc. But like there are various ways to do this, but I truly think that this is one concept about what the future could behold in the coming years. I won't write about my other thoughts because I really would enjoy this type of a thing even if I probably wouldn't play the game, but instead would do virtual graffiti in the streets or make art to my own world when walking in the streets. I have a very good plan how to do art, but that is something that I won't share because that's a thing which could get me like 100 €, but we all talking about a very big amount of money that someone could do?","author_fullname":"t2_gjqmwbjx","saved":false,"mod_reason_title":null,"gilded":0,"clicked":false,"title":"It's no low effort, but a vision about the future. I joined this subreddit without any kind of understanding about coding, etc., but I have a vision. It could be dumb, but I think that the 3D map of the actual world is inevitable.","link_flair_richtext":[],"subreddit_name_prefixed":"r\/augmentedreality","hidden":false,"pwls":6,"link_flair_css_class":"","downs":0,"thumbnail_height":null,"top_awarded_type":null,"hide_score":true,"name":"t3_18ij66i","quarantine":false,"link_flair_text_color":"light","upvote_ratio":1.0,"author_flair_background_color":null,"subreddit_type":"public","ups":1,"total_awards_received":0,"media_embed":{},"thumbnail_width":null,"author_flair_template_id":null,"is_original_content":false,"user_reports":[],"secure_media":null,"is_reddit_media_domain":false,"is_meta":false,"category":null,"secure_media_embed":{},"link_flair_text":"AR Experiences","can_mod_post":false,"score":1,"approved_by":null,"is_created_from_ads_ui":false,"author_premium":false,"thumbnail":"self","edited":false,"author_flair_css_class":null,"author_flair_richtext":[],"gildings":{},"content_categories":null,"is_self":true,"mod_note":null,"created":1702589266.0,"link_flair_type":"text","wls":6,"removed_by_category":null,"banned_by":null,"author_flair_type":"text","domain":"self.augmentedreality","allow_live_comments":false,"selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay? If you are into coding and understand what I mean then you could make a lot of money. I don&amp;#39;t have much money, but I don&amp;#39;t care because I just want to see changes in this world. I assume that even today this is quite possible - not exactly photorealistic, but I will tell you about my dumb idea. I know that some of you won&amp;#39;t like, if, if you just want to play with a mouse+keyboard or with a console, but it&amp;#39;s still a good idea and if a person who reads this is into coding and understands the concepts then he\/she should or might be able to start a company to make this game a reality.&lt;\/p&gt;\n\n&lt;p&gt;First of all it needs that a 3D map is made out of the actual world. It could be done with something like Meta Quest 3, etc. in the streets instead of apartments creating a 3D map that is sent to the cloud or some kind of servers and from such the 3D map could exist. Another way could be AI and how you could at some point have AI which could understand what is a wall and what is the street and then you could make a kinda simplified map. I&amp;#39;m not that good in this, but this is just an idea and I try to convince you of this?&lt;\/p&gt;\n\n&lt;p&gt;When you have a 3D map of the actual world then you can put all kinds of items and objects from videos games, movies, etc. inside of it. Let&amp;#39;s just think this in terms of World of Warcraft, Overwatch, Borderlands, etc. in the actual world. I mean that there could be basic mobs and there could be also world events, bosses, etc. Possibly there could also be raids. I mean that you could go to a stadium and then collaborate with your guild, clan, etc. to defeat the hardest bosses by also then gaining the best loots in the game or at least good loot. But the thing is that you could put anything into the 3D map.&lt;\/p&gt;\n\n&lt;p&gt;I mean with the Overwatch that you could pick a class in the game. You could be a sniper or you could be an engineer with a turret. Of course you couldn&amp;#39;t do everything exact to something like Overwatch because tanks would move at your own speed, but it&amp;#39;s possible to use imagination. There could be a class that has a shield and also when a group is within the boundaries they could heal or get a damage boost. There could be the turrets. There could be a grenadier, etc. and some kind of cowboy or a person with a bow. I mean different kinds of classes.&lt;\/p&gt;\n\n&lt;p&gt;And what comes to World of Warcraft and Borderlands. I mean that you would get constantly upgrading loot. But the thing would be that you could sell and trade them to others. I would think that the company or industry who would do this would probably take percentages by each trade, buy, sell, etc., but it could be just 5 % or something. Also the loot would be so that when you destroy the loot then you get materials, so that every single item that would come in the game could have a material to be sold in an auction house, etc.&lt;\/p&gt;\n\n&lt;p&gt;But the reason why to go into this path is that think about it? Pokemon Go was released and it was downloaded 1 billion times. It probably wasn&amp;#39;t by 1 billion people, but think about it? If a person or a group would make this game - and I think that it&amp;#39;s like Thanos, quite inevitable - then let&amp;#39;s assume that like in FIFA there is the HUT and you could purchase chests for around 1 € to 10 €. If there was 100 million people who would buy items of that amount 10 € a week then it would mean 4 billion euros or dollars in a month. Of course there could be more players and there are the trades, but it could be roughly around 50 billion to 200 billion euros or dollars a year of profit?&lt;\/p&gt;\n\n&lt;p&gt;Still the reason for me is this? Let&amp;#39;s think that you would play the game and could get 20 items in an hour. Let&amp;#39;s say that 3 of them would be 1 € and rest would be 0,10 €. That would mean around 5 € in an hour. In Europe, like in Berlin you can get your own room in an hostel for 20 € a night and that would mean that you would have to play for 4 hours to have a room. There also costs a beer 0,5 l around 0,40 € and you could get a lot of them in one hour. You could also eat and at the same time you could always get an item that costs 10-1000 €. I mean that when homeless people would have the gear then they would manage?&lt;\/p&gt;\n\n&lt;p&gt;It&amp;#39;s just that in capitalism it doesn&amp;#39;t mean that much what you do, but that you do something. Most of the work in this world isn&amp;#39;t actually productive, but I won&amp;#39;t go too much into that. In the end I just want to tell that the 3D map is certain to come. It&amp;#39;s about art, it could be about robots interacting through a virtual environment to this one by different means. And I would predict that many people would actually want to play a game which they wouldn&amp;#39;t spend money without the possibility of gaining money.&lt;\/p&gt;\n\n&lt;p&gt;Of course people who work could buy chests, etc. or items from others and gain loot faster, but this is just my concept of an AR game. Also depending how it&amp;#39;s done then you could play also different kinds of games within it. I like the concept of a game I call &amp;quot;Turf Wars&amp;quot;. You get from your neighborhood a suburb and then different suburbs try to take control over others. But the thing is that this could have implications like why to be in gangs when you could play a game and earn a bit of money? Of course people would probably still sell dope, but that isn&amp;#39;t that bad?&lt;\/p&gt;\n\n&lt;p&gt;Okay? I should end this, but I would assume that something like this is inevitable and as a stupid ending I could write that I see a world where people interact with each other. Not in a virtual world, but like when you are having a coffee and look upon a woman and through your glasses - put a like - then a woman there could put a like and you could share a cup of coffee quite easily. But I don&amp;#39;t even have a clue what the world will be in ten years from now with artificial intelligence and by artificial general intelligence, but I think that there are capabilities for this already and it would be quite good to make a program or an app that would start to make a 3D map out of the world. It doesn&amp;#39;t have to be that detailed, but I drank couple of beers? So, please don&amp;#39;t attack this writing and if you like it then there could come a person who can do it. I&amp;#39;m not interested about the wealth because it&amp;#39;s inevitable, so why should I get something from what I didn&amp;#39;t participate it and only just wrote what the future could behold?&lt;\/p&gt;\n\n&lt;p&gt;-----&lt;\/p&gt;\n\n&lt;p&gt;Okay? I read it through - could be some mistakes because I&amp;#39;m from Finland, but the thing is that the 3D map would be the concept and anyone could do any kind of games within it. It could be that Roblox will do this or then it could be Epic. Maybe NVIDIA will start to go towards this and they could test robots in virtual environments to act in the actual world through the 3D map. It could be that ChatGPT comes so advanced in couple of years that you could ask it to make a 3D map through videos and pictures. And yes! I believe that people wouldn&amp;#39;t play games where it would cost 500 € a month to progress, or some could do such, but nothing like Diablo: Immortal, etc.&lt;\/p&gt;\n\n&lt;p&gt;-----&lt;\/p&gt;\n\n&lt;p&gt;Remembered what I was on about? I don&amp;#39;t know does DLSS work this way, but I watched a documentary where there was that we have a very poor vision and our brain decode the environment to UHD. There could even come photorealism if there was a chip that could do such and from 1080p or less there could be made an upgrade to the experience, but this is all and if people want to see this as a reality faster and make big bucks themselves then why not, but I don&amp;#39;t know how to code, but it would be interested to see what happens? And it&amp;#39;s Ready Player One, but with people interacting like there could come Megatron as an event to a town square and have hundreds of people shooting it and his minions, etc. Maybe in five to ten years?&lt;\/p&gt;\n\n&lt;p&gt;-----&lt;\/p&gt;\n\n&lt;p&gt;Sorry, but this is just my little brain child, but it could be also done that certain items like green or some other colour could only be got by doing deeds like helping the elderly, etc. But like there are various ways to do this, but I truly think that this is one concept about what the future could behold in the coming years. I won&amp;#39;t write about my other thoughts because I really would enjoy this type of a thing even if I probably wouldn&amp;#39;t play the game, but instead would do virtual graffiti in the streets or make art to my own world when walking in the streets. I have a very good plan how to do art, but that is something that I won&amp;#39;t share because that&amp;#39;s a thing which could get me like 100 €, but we all talking about a very big amount of money that someone could do?&lt;\/p&gt;\n&lt;\/div&gt;&lt;!-- SC_ON --&gt;","likes":null,"suggested_sort":null,"banned_at_utc":null,"view_count":null,"archived":false,"no_follow":true,"is_crosspostable":false,"pinned":false,"over_18":false,"all_awardings":[],"awarders":[],"media_only":false,"link_flair_template_id":"ab387f30-05ea-11ee-86a1-2ab188a85b4c","can_gild":false,"spoiler":false,"locked":false,"author_flair_text":null,"treatment_tags":[],"visited":false,"removed_by":null,"num_reports":null,"distinguished":null,"subreddit_id":"t5_2r2jj","author_is_blocked":false,"mod_reason_by":null,"removal_reason":null,"link_flair_background_color":"#12c7b8","id":"18ij66i","is_robot_indexable":true,"report_reasons":null,"author":"MC_Habanero","discussion_type":null,"num_comments":1,"send_replies":true,"whitelist_status":"all_ads","contest_mode":false,"mod_reports":[],"author_patreon_flair":false,"author_flair_text_color":null,"permalink":"\/r\/augmentedreality\/comments\/18ij66i\/its_no_low_effort_but_a_vision_about_the_future_i\/","parent_whitelist_status":"all_ads","stickied":false,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/18ij66i\/its_no_low_effort_but_a_vision_about_the_future_i\/","subreddit_subscribers":45018,"created_utc":1702589266.0,"num_crossposts":0,"media":null,"is_video":false},{"approved_at_utc":null,"subreddit":"augmentedreality","selftext":"I’ve been trying to figure out if I’ll find it easier to design for XR on a tool like ShapesXR which works in a headset.\nI’m skeptical about this because I think that being precise while using a headset is pretty hard. \nI think that certain features must be easier to use on ShapesXR\/headsets (say positioning or blocking) but because keyboards are so hard to use I can see how importing, precise positioning would require a desktop app. \nWould love to hear from anyone who has used tools on both platforms — ShapesXR for headsets and say Bezi or Unity even for laptops.","author_fullname":"t2_l736earu","saved":false,"mod_reason_title":null,"gilded":0,"clicked":false,"title":"Is it easier to create XR experiences from your headset or your laptop?","link_flair_richtext":[],"subreddit_name_prefixed":"r\/augmentedreality","hidden":false,"pwls":6,"link_flair_css_class":"","downs":0,"thumbnail_height":null,"top_awarded_type":null,"hide_score":true,"name":"t3_181qneb","quarantine":false,"link_flair_text_color":"light","upvote_ratio":1.0,"author_flair_background_color":null,"subreddit_type":"public","ups":1,"total_awards_received":0,"media_embed":{},"thumbnail_width":null,"author_flair_template_id":null,"is_original_content":false,"user_reports":[],"secure_media":null,"is_reddit_media_domain":false,"is_meta":false,"category":null,"secure_media_embed":{},"link_flair_text":"Developer Question","can_mod_post":false,"score":1,"approved_by":null,"is_created_from_ads_ui":false,"author_premium":false,"thumbnail":"self","edited":false,"author_flair_css_class":null,"author_flair_richtext":[],"gildings":{},"content_categories":null,"is_self":true,"mod_note":null,"created":1700706400.0,"link_flair_type":"text","wls":6,"removed_by_category":null,"banned_by":null,"author_flair_type":"text","domain":"self.augmentedreality","allow_live_comments":false,"selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been trying to figure out if I’ll find it easier to design for XR on a tool like ShapesXR which works in a headset.\nI’m skeptical about this because I think that being precise while using a headset is pretty hard. \nI think that certain features must be easier to use on ShapesXR\/headsets (say positioning or blocking) but because keyboards are so hard to use I can see how importing, precise positioning would require a desktop app. \nWould love to hear from anyone who has used tools on both platforms — ShapesXR for headsets and say Bezi or Unity even for laptops.&lt;\/p&gt;\n&lt;\/div&gt;&lt;!-- SC_ON --&gt;","likes":null,"suggested_sort":null,"banned_at_utc":null,"view_count":null,"archived":false,"no_follow":false,"is_crosspostable":false,"pinned":false,"over_18":false,"all_awardings":[],"awarders":[],"media_only":false,"link_flair_template_id":"fff3ccdc-05ea-11ee-84ca-ea85d2934158","can_gild":false,"spoiler":false,"locked":false,"author_flair_text":null,"treatment_tags":[],"visited":false,"removed_by":null,"num_reports":null,"distinguished":null,"subreddit_id":"t5_2r2jj","author_is_blocked":false,"mod_reason_by":null,"removal_reason":null,"link_flair_background_color":"#0000a6","id":"181qneb","is_robot_indexable":true,"report_reasons":null,"author":"v-mohan","discussion_type":null,"num_comments":0,"send_replies":true,"whitelist_status":"all_ads","contest_mode":false,"mod_reports":[],"author_patreon_flair":false,"author_flair_text_color":null,"permalink":"\/r\/augmentedreality\/comments\/181qneb\/is_it_easier_to_create_xr_experiences_from_your\/","parent_whitelist_status":"all_ads","stickied":false,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/181qneb\/is_it_easier_to_create_xr_experiences_from_your\/","subreddit_subscribers":44760,"created_utc":1700706400.0,"num_crossposts":0,"media":null,"is_video":false},{"approved_at_utc":null,"subreddit":"augmentedreality","selftext":"Hi everyone, we've just released our devlog#5.\n\nThis week we unveil a new design iteration for LXR, our AR Laptop for productivity.  \nDiscover more here: [https:\/\/innoverse.substack.com\/p\/lxr-devlog-5-building-the-shape-shifter](https:\/\/innoverse.substack.com\/p\/lxr-devlog-4-building-the-shark).  \n\n\n[Parts of our latest design iteration, including 2 alt. keyboards](https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=1456&amp;format=pjpg&amp;auto=webp&amp;s=ae3dbeba79822d07e32bbaa36198c0b5fdf9b8a2)\n\nWe think that it may be our most versatile &amp; advanced prototype to date.  \nNew case, New alternative keyboard, and a stronger identity.\n\nDo you have some suggestions? We would happily onboard them if possible!\n\nThanks!","author_fullname":"t2_jhecf2we","saved":false,"mod_reason_title":null,"gilded":0,"clicked":false,"title":"LXR Devlog #5 - Our most versatile prototype yet!","link_flair_richtext":[],"subreddit_name_prefixed":"r\/augmentedreality","hidden":false,"pwls":6,"link_flair_css_class":"","downs":0,"thumbnail_height":78,"top_awarded_type":null,"hide_score":true,"media_metadata":{"0gs0fyqa2o0c1":{"status":"valid","e":"Image","m":"image\/jpg","p":[{"y":60,"x":108,"u":"https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=9c4b6b15e9f35884f8a27097b80e38f65370bdea"},{"y":121,"x":216,"u":"https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=af1bc71df9f42bb1f82d0b85a9e4be67254fcd21"},{"y":180,"x":320,"u":"https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=9097e189dc47958b17259ecda9883568bfe6e3fa"},{"y":360,"x":640,"u":"https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=d8677faa932c172ab895a9a55ba50c4ac788edb7"},{"y":540,"x":960,"u":"https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=3380da53b54341d662e0d6328ead2b5bb0727ae3"},{"y":607,"x":1080,"u":"https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=c2004f62cae23347b0fdf64013deb8f0074b9496"}],"s":{"y":819,"x":1456,"u":"https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=1456&amp;format=pjpg&amp;auto=webp&amp;s=ae3dbeba79822d07e32bbaa36198c0b5fdf9b8a2"},"id":"0gs0fyqa2o0c1"}},"name":"t3_17whk10","quarantine":false,"link_flair_text_color":"light","upvote_ratio":1.0,"author_flair_background_color":null,"subreddit_type":"public","ups":1,"total_awards_received":0,"media_embed":{},"thumbnail_width":140,"author_flair_template_id":null,"is_original_content":false,"user_reports":[],"secure_media":null,"is_reddit_media_domain":false,"is_meta":false,"category":null,"secure_media_embed":{},"link_flair_text":"AR Development","can_mod_post":false,"score":1,"approved_by":null,"is_created_from_ads_ui":false,"author_premium":false,"thumbnail":"https:\/\/a.thumbs.redditmedia.com\/1vMTqd1oSs0hOIE-BB_--tz1ZlBeVwu2-kLDnXv97n8.jpg","edited":false,"author_flair_css_class":null,"author_flair_richtext":[],"gildings":{},"content_categories":null,"is_self":true,"mod_note":null,"created":1700121587.0,"link_flair_type":"text","wls":6,"removed_by_category":null,"banned_by":null,"author_flair_type":"text","domain":"self.augmentedreality","allow_live_comments":false,"selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone, we&amp;#39;ve just released our devlog#5.&lt;\/p&gt;\n\n&lt;p&gt;This week we unveil a new design iteration for LXR, our AR Laptop for productivity.&lt;br\/&gt;\nDiscover more here: &lt;a href=\"https:\/\/innoverse.substack.com\/p\/lxr-devlog-4-building-the-shark\"&gt;https:\/\/innoverse.substack.com\/p\/lxr-devlog-5-building-the-shape-shifter&lt;\/a&gt;.  &lt;\/p&gt;\n\n&lt;p&gt;&lt;a href=\"https:\/\/preview.redd.it\/0gs0fyqa2o0c1.jpg?width=1456&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=ae3dbeba79822d07e32bbaa36198c0b5fdf9b8a2\"&gt;Parts of our latest design iteration, including 2 alt. keyboards&lt;\/a&gt;&lt;\/p&gt;\n\n&lt;p&gt;We think that it may be our most versatile &amp;amp; advanced prototype to date.&lt;br\/&gt;\nNew case, New alternative keyboard, and a stronger identity.&lt;\/p&gt;\n\n&lt;p&gt;Do you have some suggestions? We would happily onboard them if possible!&lt;\/p&gt;\n\n&lt;p&gt;Thanks!&lt;\/p&gt;\n&lt;\/div&gt;&lt;!-- SC_ON --&gt;","likes":null,"suggested_sort":null,"banned_at_utc":null,"view_count":null,"archived":false,"no_follow":true,"is_crosspostable":false,"pinned":false,"over_18":false,"all_awardings":[],"awarders":[],"media_only":false,"link_flair_template_id":"f5e1d6ee-05ea-11ee-ac00-deb6d1fbd8bb","can_gild":false,"spoiler":false,"locked":false,"author_flair_text":null,"treatment_tags":[],"visited":false,"removed_by":null,"num_reports":null,"distinguished":null,"subreddit_id":"t5_2r2jj","author_is_blocked":false,"mod_reason_by":null,"removal_reason":null,"link_flair_background_color":"#0000a6","id":"17whk10","is_robot_indexable":true,"report_reasons":null,"author":"Loraime-Ipsoum","discussion_type":null,"num_comments":1,"send_replies":true,"whitelist_status":"all_ads","contest_mode":false,"mod_reports":[],"author_patreon_flair":false,"author_flair_text_color":null,"permalink":"\/r\/augmentedreality\/comments\/17whk10\/lxr_devlog_5_our_most_versatile_prototype_yet\/","parent_whitelist_status":"all_ads","stickied":false,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/17whk10\/lxr_devlog_5_our_most_versatile_prototype_yet\/","subreddit_subscribers":44666,"created_utc":1700121587.0,"num_crossposts":0,"media":null,"is_video":false},{"approved_at_utc":null,"subreddit":"augmentedreality","selftext":"Pianogram is an augmented reality application that allows you to visualize notes on top of your piano using augmented reality, providing a visual aid for when to play the piano keys and accelerating the time it takes to master your favorite songs.\n\nIn this app, you can:\n\n\\- Visualize notes on 3D space with augmented reality.\n\n\\- Connect the keyboard to the headset and play in practice mode.\n\n\\- Upload any MIDI song from the web to play.\n\n\\- Change the speed of songs.\n\n\\- Create loops for replaying tricky parts of the song.","author_fullname":"t2_aec7h29q","saved":false,"mod_reason_title":null,"gilded":0,"clicked":false,"title":"Pianogram","link_flair_richtext":[],"subreddit_name_prefixed":"r\/augmentedreality","hidden":false,"pwls":6,"link_flair_css_class":"","downs":0,"thumbnail_height":null,"top_awarded_type":null,"hide_score":true,"name":"t3_16fd73r","quarantine":false,"link_flair_text_color":"light","upvote_ratio":1.0,"author_flair_background_color":null,"subreddit_type":"public","ups":1,"total_awards_received":0,"media_embed":{},"thumbnail_width":null,"author_flair_template_id":null,"is_original_content":false,"user_reports":[],"secure_media":null,"is_reddit_media_domain":false,"is_meta":false,"category":null,"secure_media_embed":{},"link_flair_text":"Self Promotion","can_mod_post":false,"score":1,"approved_by":null,"is_created_from_ads_ui":false,"author_premium":false,"thumbnail":"self","edited":false,"author_flair_css_class":null,"author_flair_richtext":[],"gildings":{},"content_categories":null,"is_self":true,"mod_note":null,"created":1694383281.0,"link_flair_type":"text","wls":6,"removed_by_category":null,"banned_by":null,"author_flair_type":"text","domain":"self.augmentedreality","allow_live_comments":false,"selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pianogram is an augmented reality application that allows you to visualize notes on top of your piano using augmented reality, providing a visual aid for when to play the piano keys and accelerating the time it takes to master your favorite songs.&lt;\/p&gt;\n\n&lt;p&gt;In this app, you can:&lt;\/p&gt;\n\n&lt;p&gt;- Visualize notes on 3D space with augmented reality.&lt;\/p&gt;\n\n&lt;p&gt;- Connect the keyboard to the headset and play in practice mode.&lt;\/p&gt;\n\n&lt;p&gt;- Upload any MIDI song from the web to play.&lt;\/p&gt;\n\n&lt;p&gt;- Change the speed of songs.&lt;\/p&gt;\n\n&lt;p&gt;- Create loops for replaying tricky parts of the song.&lt;\/p&gt;\n&lt;\/div&gt;&lt;!-- SC_ON --&gt;","likes":null,"suggested_sort":null,"banned_at_utc":null,"view_count":null,"archived":false,"no_follow":true,"is_crosspostable":false,"pinned":false,"over_18":false,"all_awardings":[],"awarders":[],"media_only":false,"link_flair_template_id":"b08367c2-5956-11eb-8bec-0e2a5f45a149","can_gild":false,"spoiler":false,"locked":false,"author_flair_text":null,"treatment_tags":[],"visited":false,"removed_by":null,"num_reports":null,"distinguished":null,"subreddit_id":"t5_2r2jj","author_is_blocked":false,"mod_reason_by":null,"removal_reason":null,"link_flair_background_color":"#ff8d00","id":"16fd73r","is_robot_indexable":true,"report_reasons":null,"author":"FinanceSilent6142","discussion_type":null,"num_comments":0,"send_replies":true,"whitelist_status":"all_ads","contest_mode":false,"mod_reports":[],"author_patreon_flair":false,"author_flair_text_color":null,"permalink":"\/r\/augmentedreality\/comments\/16fd73r\/pianogram\/","parent_whitelist_status":"all_ads","stickied":false,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/16fd73r\/pianogram\/","subreddit_subscribers":43802,"created_utc":1694383281.0,"num_crossposts":0,"media":null,"is_video":false},{"approved_at_utc":null,"subreddit":"augmentedreality","selftext":"","author_fullname":"t2_65qubpefi","saved":false,"mod_reason_title":null,"gilded":0,"clicked":false,"title":"Boz types at 119 words per minute in Quest with Reality Labs virtual keyboard","link_flair_richtext":[],"subreddit_name_prefixed":"r\/augmentedreality","hidden":false,"pwls":6,"link_flair_css_class":"","downs":0,"thumbnail_height":78,"top_awarded_type":null,"hide_score":true,"name":"t3_164l2le","quarantine":false,"link_flair_text_color":"light","upvote_ratio":1.0,"author_flair_background_color":null,"ups":1,"total_awards_received":0,"media_embed":{},"thumbnail_width":140,"author_flair_template_id":null,"is_original_content":false,"user_reports":[],"secure_media":null,"is_reddit_media_domain":false,"is_meta":false,"category":null,"secure_media_embed":{},"link_flair_text":"AR Devices","can_mod_post":false,"score":1,"approved_by":null,"is_created_from_ads_ui":false,"author_premium":false,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/V5o_35Wgl9MZH6C3bMtd5LawFL9ZFXR00dsXLGX2lCo.jpg","edited":false,"author_flair_css_class":null,"author_flair_richtext":[],"gildings":{},"post_hint":"link","content_categories":null,"is_self":false,"subreddit_type":"public","created":1693321828.0,"link_flair_type":"text","wls":6,"removed_by_category":null,"banned_by":null,"author_flair_type":"text","domain":"mixed-news.com","allow_live_comments":false,"selftext_html":null,"likes":null,"suggested_sort":null,"banned_at_utc":null,"url_overridden_by_dest":"https:\/\/mixed-news.com\/en\/boz-types-at-119-wpm-in-quest-with-reality-labs-virtual-keyboard\/?amp=1","view_count":null,"archived":false,"no_follow":true,"is_crosspostable":false,"pinned":false,"over_18":false,"preview":{"images":[{"source":{"url":"https:\/\/external-preview.redd.it\/ZbknGywKy1ZhSZf96bP_a98qcV5be80T3F0E3LjE6II.jpg?auto=webp&amp;s=0653765db12512a859eead8972b75b7896bf0be2","width":2178,"height":1225},"resolutions":[{"url":"https:\/\/external-preview.redd.it\/ZbknGywKy1ZhSZf96bP_a98qcV5be80T3F0E3LjE6II.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=ac11e0ad6d6040e66907371842b01b4781071948","width":108,"height":60},{"url":"https:\/\/external-preview.redd.it\/ZbknGywKy1ZhSZf96bP_a98qcV5be80T3F0E3LjE6II.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=007056b0fd48bf9932e5e0f01aae39472b1363b3","width":216,"height":121},{"url":"https:\/\/external-preview.redd.it\/ZbknGywKy1ZhSZf96bP_a98qcV5be80T3F0E3LjE6II.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=53684322974d71808902cea72c631909759f8706","width":320,"height":179},{"url":"https:\/\/external-preview.redd.it\/ZbknGywKy1ZhSZf96bP_a98qcV5be80T3F0E3LjE6II.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=3d4f75c86630df4a1bb779fa480ac5240430dfd9","width":640,"height":359},{"url":"https:\/\/external-preview.redd.it\/ZbknGywKy1ZhSZf96bP_a98qcV5be80T3F0E3LjE6II.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=6f07c50dba7157cd6db310dd73b9ff25253bf9eb","width":960,"height":539},{"url":"https:\/\/external-preview.redd.it\/ZbknGywKy1ZhSZf96bP_a98qcV5be80T3F0E3LjE6II.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=bd4804fab0e6372b8448d6cf4f4cbaa9b56656a8","width":1080,"height":607}],"variants":{},"id":"ozKtvPXK0B5bTGKBIJTK993o7eE11QD050mdCsAS5rc"}],"enabled":false},"all_awardings":[],"awarders":[],"media_only":false,"link_flair_template_id":"30a287ba-05eb-11ee-bef5-6e25676441c1","can_gild":false,"spoiler":false,"locked":false,"author_flair_text":null,"treatment_tags":[],"visited":false,"removed_by":null,"mod_note":null,"distinguished":null,"subreddit_id":"t5_2r2jj","author_is_blocked":false,"mod_reason_by":null,"num_reports":null,"removal_reason":null,"link_flair_background_color":"#ba4cd9","id":"164l2le","is_robot_indexable":true,"report_reasons":null,"author":"kosupata","discussion_type":null,"num_comments":0,"send_replies":false,"whitelist_status":"all_ads","contest_mode":false,"mod_reports":[],"author_patreon_flair":false,"author_flair_text_color":null,"permalink":"\/r\/augmentedreality\/comments\/164l2le\/boz_types_at_119_words_per_minute_in_quest_with\/","parent_whitelist_status":"all_ads","stickied":false,"url":"https:\/\/mixed-news.com\/en\/boz-types-at-119-wpm-in-quest-with-reality-labs-virtual-keyboard\/?amp=1","subreddit_subscribers":43532,"created_utc":1693321828.0,"num_crossposts":0,"media":null,"is_video":false},{"approved_at_utc":null,"subreddit":"augmentedreality","selftext":"","author_fullname":"t2_n0sm1","saved":false,"mod_reason_title":null,"gilded":0,"clicked":false,"title":"Virtual typing for Spatial Computing with Fleksy's Predictive Keyboard SDK","link_flair_richtext":[],"subreddit_name_prefixed":"r\/augmentedreality","hidden":false,"pwls":6,"link_flair_css_class":"","downs":0,"thumbnail_height":78,"top_awarded_type":null,"hide_score":false,"name":"t3_144a499","quarantine":false,"link_flair_text_color":"light","upvote_ratio":1.0,"author_flair_background_color":null,"ups":5,"total_awards_received":0,"media_embed":{},"thumbnail_width":140,"author_flair_template_id":null,"is_original_content":false,"user_reports":[],"secure_media":null,"is_reddit_media_domain":false,"is_meta":false,"category":null,"secure_media_embed":{},"link_flair_text":"AR Development","can_mod_post":false,"score":5,"approved_by":null,"is_created_from_ads_ui":false,"author_premium":false,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/qjVEizwkw77lRv8BT3xPSRy8zwlsAFaKRxIVQS42Xpw.jpg","edited":false,"author_flair_css_class":null,"author_flair_richtext":[],"gildings":{},"post_hint":"link","content_categories":null,"is_self":false,"subreddit_type":"public","created":1686232882.0,"link_flair_type":"text","wls":6,"removed_by_category":null,"banned_by":null,"author_flair_type":"text","domain":"fleksy.com","allow_live_comments":false,"selftext_html":null,"likes":null,"suggested_sort":null,"banned_at_utc":null,"url_overridden_by_dest":"https:\/\/www.fleksy.com\/blog\/virtual-typing-for-spatial-computing-with-fleksys-predictive-keyboard-sdk\/","view_count":null,"archived":false,"no_follow":false,"is_crosspostable":false,"pinned":false,"over_18":false,"preview":{"images":[{"source":{"url":"https:\/\/external-preview.redd.it\/YlLVD_GtEFtmyEgpNRmTKyfUg9dAWdLn9HDmtKWtQ8c.jpg?auto=webp&amp;s=56dfb3dd451203796496ed9600cbf9cf96b4c77d","width":2500,"height":1400},"resolutions":[{"url":"https:\/\/external-preview.redd.it\/YlLVD_GtEFtmyEgpNRmTKyfUg9dAWdLn9HDmtKWtQ8c.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=4e86b19617f179f5b74172c6879f2dd71d872224","width":108,"height":60},{"url":"https:\/\/external-preview.redd.it\/YlLVD_GtEFtmyEgpNRmTKyfUg9dAWdLn9HDmtKWtQ8c.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=813d20f6a0c5309bcc54f90e9abb4c156f342e7e","width":216,"height":120},{"url":"https:\/\/external-preview.redd.it\/YlLVD_GtEFtmyEgpNRmTKyfUg9dAWdLn9HDmtKWtQ8c.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=c62c544865938cc173ffd4fa0165b27b6e4e76e9","width":320,"height":179},{"url":"https:\/\/external-preview.redd.it\/YlLVD_GtEFtmyEgpNRmTKyfUg9dAWdLn9HDmtKWtQ8c.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=1cc88a07a356d33e9fb4e1bc10dc32d9addfb17f","width":640,"height":358},{"url":"https:\/\/external-preview.redd.it\/YlLVD_GtEFtmyEgpNRmTKyfUg9dAWdLn9HDmtKWtQ8c.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=bf00ab8039fc144b574a12abe37be2b4af04c415","width":960,"height":537},{"url":"https:\/\/external-preview.redd.it\/YlLVD_GtEFtmyEgpNRmTKyfUg9dAWdLn9HDmtKWtQ8c.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=d2c7346fe3ea22b9ba79e69443562ff8be06ef21","width":1080,"height":604}],"variants":{},"id":"dm8-crjJJL2AY6FyjBLUO3yWk_KARQsekPs5uNH3TA4"}],"enabled":false},"all_awardings":[],"awarders":[],"media_only":false,"link_flair_template_id":"f5e1d6ee-05ea-11ee-ac00-deb6d1fbd8bb","can_gild":false,"spoiler":false,"locked":false,"author_flair_text":null,"treatment_tags":[],"visited":false,"removed_by":null,"mod_note":null,"distinguished":null,"subreddit_id":"t5_2r2jj","author_is_blocked":false,"mod_reason_by":null,"num_reports":null,"removal_reason":null,"link_flair_background_color":"#0000a6","id":"144a499","is_robot_indexable":true,"report_reasons":null,"author":"oplante","discussion_type":null,"num_comments":0,"send_replies":true,"whitelist_status":"all_ads","contest_mode":false,"mod_reports":[],"author_patreon_flair":false,"author_flair_text_color":null,"permalink":"\/r\/augmentedreality\/comments\/144a499\/virtual_typing_for_spatial_computing_with_fleksys\/","parent_whitelist_status":"all_ads","stickied":false,"url":"https:\/\/www.fleksy.com\/blog\/virtual-typing-for-spatial-computing-with-fleksys-predictive-keyboard-sdk\/","subreddit_subscribers":43327,"created_utc":1686232882.0,"num_crossposts":0,"media":null,"is_video":false},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"afox1984","author_created_utc":1494085911,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_d2jkn6","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1674902412,"discussion_type":null,"distinguished":null,"domain":"v.redd.it","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"10nc824","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":true,"is_robot_indexable":true,"is_self":false,"is_video":true,"link_flair_background_color":"#7193ff","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"d634b96c-5956-11eb-82e4-0edbacc3d4db","link_flair_text":"Concept Design","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":{"reddit_video":{"bitrate_kbps":4800,"dash_url":"https:\/\/v.redd.it\/yrbawm8o0tea1\/DASHPlaylist.mpd?a=1678819136%2CZGRhNDVkYTNhOTRmYWY2ZGY0MmJiMGMyZTIzZjExMGRjNjdhZmIyYTVjMmFjYjlhNjQ3ZGZlMGQ4MGNiOGE2OA%3D%3D&amp;v=1&amp;f=sd","duration":26,"fallback_url":"https:\/\/v.redd.it\/yrbawm8o0tea1\/DASH_1080.mp4?source=fallback","height":1080,"hls_url":"https:\/\/v.redd.it\/yrbawm8o0tea1\/HLSPlaylist.m3u8?a=1678819136%2CZTZmY2JmZDczMjViMWFiNzAyZWRiMDlmNTJiMDFhMWFlNmExMWZiZmEwY2JjZDRhNDQ1NmRiNTMxY2UwMDBiMA%3D%3D&amp;v=1&amp;f=sd","is_gif":false,"scrubber_media_url":"https:\/\/v.redd.it\/yrbawm8o0tea1\/DASH_96.mp4","transcoding_status":"completed","width":608}},"media_embed":{},"media_only":false,"name":"t3_10nc824","no_follow":false,"num_comments":26,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/10nc824\/is_this_the_bestquickestmost_effective_way_to\/","pinned":false,"post_hint":"hosted:video","preview":{"enabled":false,"images":[{"id":"ldMKLp3gKjVEo8NlF9c06Uwd3fEMxvFjvA4bEThev4Y","resolutions":[{"height":192,"url":"https:\/\/external-preview.redd.it\/MQdND3MIRA8sL-F4FbnmMGdJDs6fD031lPozzGUkbb4.png?width=108&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=8b6e3211cad79d41971de1fb9ae7531813ec6d43","width":108},{"height":384,"url":"https:\/\/external-preview.redd.it\/MQdND3MIRA8sL-F4FbnmMGdJDs6fD031lPozzGUkbb4.png?width=216&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=f7473d61a3df550a2926513fbf89afba01451e1c","width":216},{"height":568,"url":"https:\/\/external-preview.redd.it\/MQdND3MIRA8sL-F4FbnmMGdJDs6fD031lPozzGUkbb4.png?width=320&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=c9b2936597e7e1fb92378564457410346c9043da","width":320},{"height":1137,"url":"https:\/\/external-preview.redd.it\/MQdND3MIRA8sL-F4FbnmMGdJDs6fD031lPozzGUkbb4.png?width=640&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b45d754c13270cfb5d9207cef086f487347ad0e8","width":640},{"height":1706,"url":"https:\/\/external-preview.redd.it\/MQdND3MIRA8sL-F4FbnmMGdJDs6fD031lPozzGUkbb4.png?width=960&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=3121da1e50b854adc822bb531ec0205a1d6f5d68","width":960},{"height":1920,"url":"https:\/\/external-preview.redd.it\/MQdND3MIRA8sL-F4FbnmMGdJDs6fD031lPozzGUkbb4.png?width=1080&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=6c80b9fb3f370c131db82c58f0dd3031270cbf50","width":1080}],"source":{"height":1920,"url":"https:\/\/external-preview.redd.it\/MQdND3MIRA8sL-F4FbnmMGdJDs6fD031lPozzGUkbb4.png?format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=24e6b8e25d3d9c49ab3c050af849254cc0536998","width":1080},"variants":{}}]},"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1676227136,"score":18,"secure_media":{"reddit_video":{"bitrate_kbps":4800,"dash_url":"https:\/\/v.redd.it\/yrbawm8o0tea1\/DASHPlaylist.mpd?a=1678819136%2CZGRhNDVkYTNhOTRmYWY2ZGY0MmJiMGMyZTIzZjExMGRjNjdhZmIyYTVjMmFjYjlhNjQ3ZGZlMGQ4MGNiOGE2OA%3D%3D&amp;v=1&amp;f=sd","duration":26,"fallback_url":"https:\/\/v.redd.it\/yrbawm8o0tea1\/DASH_1080.mp4?source=fallback","height":1080,"hls_url":"https:\/\/v.redd.it\/yrbawm8o0tea1\/HLSPlaylist.m3u8?a=1678819136%2CZTZmY2JmZDczMjViMWFiNzAyZWRiMDlmNTJiMDFhMWFlNmExMWZiZmEwY2JjZDRhNDQ1NmRiNTMxY2UwMDBiMA%3D%3D&amp;v=1&amp;f=sd","is_gif":false,"scrubber_media_url":"https:\/\/v.redd.it\/yrbawm8o0tea1\/DASH_96.mp4","transcoding_status":"completed","width":608}},"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":40610,"subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/fUWgUIr4zBFFDUvuWYXP-xHQnbSfmkRhI0BgxQ0c1Ns.jpg","thumbnail_height":140,"thumbnail_width":140,"title":"Is this the best\/quickest\/most effective way to type in mixed reality? A physical keyboard will likely never be bettered but I’ve been thinking a QuickPath method could be effective and lead to mass adoption within AR\/XR. Thoughts?","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.85,"url":"https:\/\/v.redd.it\/yrbawm8o0tea1","url_overridden_by_dest":"https:\/\/v.redd.it\/yrbawm8o0tea1","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"Playful_Ratio_2052","author_created_utc":1606897167,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_94qo8qm4","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1674397546,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"10iktkp","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#0dd3bb","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"e020c046-5957-11eb-84df-0e2254a55931","link_flair_text":"Question","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_10iktkp","no_follow":false,"num_comments":3,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/10iktkp\/magic_leap_1\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1676232378,"score":0,"secure_media":null,"secure_media_embed":{},"selftext":"Hi everyone, \ni have a Chance to buy a used ML1 for a good price.\n\nI was wandering if the ML1 is worth it or if it is too old by now. I could get it for around 250€.\n\nAlso as i dont have any experience with AR and magic leap, im not Sure what to expect and if its worth the money.\n\nCan i somehow (using an app or something), Display my Laptops screen on the glasses ? And could i use a keyboard with the glasses? \n\nThanks in advance!","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":40610,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Magic Leap 1","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.5,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/10iktkp\/magic_leap_1\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"wherearemysockz","author_created_utc":1580489245,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_5hts8jp3","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1674053401,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"10f966z","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#646d73","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"00c8db46-595b-11eb-80c7-0efd43c355fd","link_flair_text":"Discussion","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_10f966z","no_follow":false,"num_comments":7,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/10f966z\/what_do_you_think_are_the_possibilities_vs_the\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1676235918,"score":5,"secure_media":null,"secure_media_embed":{},"selftext":"I’m from a media producing background, particularly film and TV, and I’ve recently been working on narrative film projects featuring AR both within the narrative universe and as part of the marketing. They’ve made me curious about the possibilities.\n\nSo, I’m mainly interested in the wonderful opinions of people in this sub about how AR can, or more probably could, be used \n\nA) within the production workflow of film and TV (pre prod, prod, post, exhibition, broadcast and marketing). For example pre visualisation, remote filming or editing without a screen or keyboard. \n\nB) to enhance the content (this is huge so I really mean just brainstorming existing examples or ideas) - for example the narrative bleeding beyond the screen or playing an AR game that also features in a film and changes the film accordingly or whatever.\n\nC) to disrupt and potentially replace certain aspects of traditional film and TV in certain contexts - are there narratives that AR will just handle better for example?","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":40610,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"What do you think are the possibilities vs the challenges for AR to be used with film and TV?","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.86,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/10f966z\/what_do_you_think_are_the_possibilities_vs_the\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"under_jump","author_created_utc":1525190405,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_lafqokj","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1673844829,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"10d5h60","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#0dd3bb","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"e020c046-5957-11eb-84df-0e2254a55931","link_flair_text":"Question","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_10d5h60","no_follow":false,"num_comments":3,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/10d5h60\/ar_headsets_that_are_good_for_productivity\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1676238108,"score":6,"secure_media":null,"secure_media_embed":{},"selftext":"Hello, I recently got the Nreal Airs which were my first pair of ar glasses and at first i was blown away by the ability to create multiple floating monitors locked in space using nebula. But was quickly disappointed when I found out you cant use a keyboard or mouse unless you switch over to Samsung DEX. Which means you can only have one big monitor that is locked to your head. this sucks because that was one of my main reasons in getting these.\n\n&amp;#x200B;\n\nCan you guys help me out and suggest some alternative AR or possibly VR headsets? My main goal is to increase my productivity and work flow on things like writing papers and coding. Im looking for something that is:\n\nLight Weight\/comfortable. \n\nportable.\n\ncompatible with keyboard and mouse.\n\nhas a good \"virtual workspace\".\n\nUnder $600","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":40610,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"AR headsets that are good for productivity","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.8,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/10d5h60\/ar_headsets_that_are_good_for_productivity\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":true,"archived":false,"author":"afox1984","author_created_utc":1494085911,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_d2jkn6","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1673800379,"discussion_type":null,"distinguished":null,"domain":"i.redd.it","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"10co1yw","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":true,"is_robot_indexable":true,"is_self":false,"is_video":false,"link_flair_background_color":"#7193ff","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"d634b96c-5956-11eb-82e4-0edbacc3d4db","link_flair_text":"Concept Design","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_10co1yw","no_follow":false,"num_comments":20,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/10co1yw\/this_makes_more_sense_to_me_than_a_2k_xr_headset\/","pinned":false,"post_hint":"image","preview":{"enabled":true,"images":[{"id":"VqKHtP0vvXqfzRsVlRp54W6IZHttGVY88QlGo5YI6oc","resolutions":[{"height":81,"url":"https:\/\/preview.redd.it\/jcy380xvz9ca1.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=c0ca7035d4e4340452b68b0d26f52fbe7c7a5a5a","width":108},{"height":162,"url":"https:\/\/preview.redd.it\/jcy380xvz9ca1.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=c04d653a26e6394a0e96f431db1ea42cc84c5115","width":216},{"height":240,"url":"https:\/\/preview.redd.it\/jcy380xvz9ca1.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=2a6e5396f58f8842fac0f2e36eb3d863ebedd5f9","width":320},{"height":480,"url":"https:\/\/preview.redd.it\/jcy380xvz9ca1.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=7d3f53d17454e9f0466e2f3069bb7d01d5ee8201","width":640},{"height":721,"url":"https:\/\/preview.redd.it\/jcy380xvz9ca1.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=b139b874acc209f11eee357218118cb67391fb86","width":960},{"height":811,"url":"https:\/\/preview.redd.it\/jcy380xvz9ca1.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=fd06ca8dcf8cb8f290a82514f4643d74803c8d80","width":1080}],"source":{"height":1253,"url":"https:\/\/preview.redd.it\/jcy380xvz9ca1.jpg?auto=webp&amp;v=enabled&amp;s=cce443ef0a2b818da054087c6b3265d002f44eec","width":1668},"variants":{}}]},"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1676238628,"score":30,"secure_media":null,"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":40611,"subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/bgvtn0uerPqP_0Y4-z61olsK0wGTVag1_h76gsnyU3g.jpg","thumbnail_height":105,"thumbnail_width":140,"title":"This makes more sense to me than a $2k XR headset ..Keyboard which is also your computer. Ring controller for point, click and scroll (charged via keyboard). Tethered glasses act as monitor\/monitors. Glasses have built in speakers or use AirPods. Glasses also plug into your phone\/iPad\/games console","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.89,"url":"https:\/\/i.redd.it\/jcy380xvz9ca1.jpg","url_overridden_by_dest":"https:\/\/i.redd.it\/jcy380xvz9ca1.jpg","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"ma__rio","author_created_utc":1614518660,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_aed9cuxp","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1669031734,"discussion_type":null,"distinguished":null,"domain":"link.jig.space","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"z0x5pl","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":false,"is_video":false,"link_flair_background_color":"#646d73","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"b08367c2-5956-11eb-8bec-0e2a5f45a149","link_flair_text":"Self Promotion","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_z0x5pl","no_follow":true,"num_comments":4,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/z0x5pl\/my_jig_space_mouse_and_keyboard_explanation\/","pinned":false,"post_hint":"link","preview":{"enabled":false,"images":[{"id":"-e_8sueBiE42HIyFU08WYTMI3Y6vs0En7iRrDDmi9N4","resolutions":[{"height":81,"url":"https:\/\/external-preview.redd.it\/A60bjZlXCczPQ06vVT7jDpcYZNYqMBwJ22Q4IApqFWE.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=f58f114d95e3a7a846d87c96d39fd55c2f19ec57","width":108},{"height":162,"url":"https:\/\/external-preview.redd.it\/A60bjZlXCczPQ06vVT7jDpcYZNYqMBwJ22Q4IApqFWE.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=c85a0c3efa56a34c30c1d60c68a64410e0321650","width":216},{"height":241,"url":"https:\/\/external-preview.redd.it\/A60bjZlXCczPQ06vVT7jDpcYZNYqMBwJ22Q4IApqFWE.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=699b30accab38865f7952117e7b09c75d35bff12","width":320}],"source":{"height":386,"url":"https:\/\/external-preview.redd.it\/A60bjZlXCczPQ06vVT7jDpcYZNYqMBwJ22Q4IApqFWE.jpg?auto=webp&amp;s=ba821c57db78045af2bb26b15e9718d306377971","width":512},"variants":{}}]},"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1673208755,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"","send_replies":false,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":40091,"subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/9rE1RzbdXVLtgdGxkhtAHdGftiOjFYYUDBAft9lMzoE.jpg","thumbnail_height":105,"thumbnail_width":140,"title":"My jig space mouse and keyboard explanation","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.56,"url":"https:\/\/link.jig.space\/fsUsf1teXub","url_overridden_by_dest":"https:\/\/link.jig.space\/fsUsf1teXub","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"afox1984","author_created_utc":1494085911,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_d2jkn6","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1667221707,"discussion_type":null,"distinguished":null,"domain":"twitter.com","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"yibnuy","is_created_from_ads_ui":false,"is_crosspostable":false,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":false,"is_self":false,"is_video":false,"link_flair_background_color":"#7193ff","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"d634b96c-5956-11eb-82e4-0edbacc3d4db","link_flair_text":"Concept Design","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":{"oembed":{"author_name":"Andrew Fox","author_url":"https:\/\/twitter.com\/afox1984","cache_age":3153600000,"height":null,"html":"&lt;blockquote class=\"twitter-video\"&gt;&lt;p lang=\"en\" dir=\"ltr\"&gt;My vision for &lt;a href=\"https:\/\/twitter.com\/Nreal?ref_src=twsrc%5Etfw\"&gt;@Nreal&lt;\/a&gt; and &lt;a href=\"https:\/\/twitter.com\/Apple?ref_src=twsrc%5Etfw\"&gt;@Apple&lt;\/a&gt; iPad functionality. Plug the glasses into your iPad and the iPad becomes a keyboard + trackpad, allowing for multiple (up to 130”) screens on the go &lt;a href=\"https:\/\/t.co\/Q5oN4m2aRJ\"&gt;pic.twitter.com\/Q5oN4m2aRJ&lt;\/a&gt;&lt;\/p&gt;&amp;mdash; Andrew Fox (@afox1984) &lt;a href=\"https:\/\/twitter.com\/afox1984\/status\/1587065070210744323?ref_src=twsrc%5Etfw\"&gt;October 31, 2022&lt;\/a&gt;&lt;\/blockquote&gt;\n&lt;script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"&gt;&lt;\/script&gt;\n","provider_name":"Twitter","provider_url":"https:\/\/twitter.com","type":"rich","url":"https:\/\/twitter.com\/afox1984\/status\/1587065070210744323","version":"1.0","width":350},"type":"twitter.com"},"media_embed":{"content":"&lt;blockquote class=\"twitter-video\"&gt;&lt;p lang=\"en\" dir=\"ltr\"&gt;My vision for &lt;a href=\"https:\/\/twitter.com\/Nreal?ref_src=twsrc%5Etfw\"&gt;@Nreal&lt;\/a&gt; and &lt;a href=\"https:\/\/twitter.com\/Apple?ref_src=twsrc%5Etfw\"&gt;@Apple&lt;\/a&gt; iPad functionality. Plug the glasses into your iPad and the iPad becomes a keyboard + trackpad, allowing for multiple (up to 130”) screens on the go &lt;a href=\"https:\/\/t.co\/Q5oN4m2aRJ\"&gt;pic.twitter.com\/Q5oN4m2aRJ&lt;\/a&gt;&lt;\/p&gt;&amp;mdash; Andrew Fox (@afox1984) &lt;a href=\"https:\/\/twitter.com\/afox1984\/status\/1587065070210744323?ref_src=twsrc%5Etfw\"&gt;October 31, 2022&lt;\/a&gt;&lt;\/blockquote&gt;\n&lt;script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"&gt;&lt;\/script&gt;\n","height":200,"scrolling":false,"width":350},"media_only":false,"name":"t3_yibnuy","no_follow":true,"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/yibnuy\/my_vision_for_nreal_air_ar_glasses_and_ipad\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":"reddit","retrieved_on":1668015676,"score":1,"secure_media":{"oembed":{"author_name":"Andrew Fox","author_url":"https:\/\/twitter.com\/afox1984","cache_age":3153600000,"height":null,"html":"&lt;blockquote class=\"twitter-video\"&gt;&lt;p lang=\"en\" dir=\"ltr\"&gt;My vision for &lt;a href=\"https:\/\/twitter.com\/Nreal?ref_src=twsrc%5Etfw\"&gt;@Nreal&lt;\/a&gt; and &lt;a href=\"https:\/\/twitter.com\/Apple?ref_src=twsrc%5Etfw\"&gt;@Apple&lt;\/a&gt; iPad functionality. Plug the glasses into your iPad and the iPad becomes a keyboard + trackpad, allowing for multiple (up to 130”) screens on the go &lt;a href=\"https:\/\/t.co\/Q5oN4m2aRJ\"&gt;pic.twitter.com\/Q5oN4m2aRJ&lt;\/a&gt;&lt;\/p&gt;&amp;mdash; Andrew Fox (@afox1984) &lt;a href=\"https:\/\/twitter.com\/afox1984\/status\/1587065070210744323?ref_src=twsrc%5Etfw\"&gt;October 31, 2022&lt;\/a&gt;&lt;\/blockquote&gt;\n&lt;script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"&gt;&lt;\/script&gt;\n","provider_name":"Twitter","provider_url":"https:\/\/twitter.com","type":"rich","url":"https:\/\/twitter.com\/afox1984\/status\/1587065070210744323","version":"1.0","width":350},"type":"twitter.com"},"secure_media_embed":{"content":"&lt;blockquote class=\"twitter-video\"&gt;&lt;p lang=\"en\" dir=\"ltr\"&gt;My vision for &lt;a href=\"https:\/\/twitter.com\/Nreal?ref_src=twsrc%5Etfw\"&gt;@Nreal&lt;\/a&gt; and &lt;a href=\"https:\/\/twitter.com\/Apple?ref_src=twsrc%5Etfw\"&gt;@Apple&lt;\/a&gt; iPad functionality. Plug the glasses into your iPad and the iPad becomes a keyboard + trackpad, allowing for multiple (up to 130”) screens on the go &lt;a href=\"https:\/\/t.co\/Q5oN4m2aRJ\"&gt;pic.twitter.com\/Q5oN4m2aRJ&lt;\/a&gt;&lt;\/p&gt;&amp;mdash; Andrew Fox (@afox1984) &lt;a href=\"https:\/\/twitter.com\/afox1984\/status\/1587065070210744323?ref_src=twsrc%5Etfw\"&gt;October 31, 2022&lt;\/a&gt;&lt;\/blockquote&gt;\n&lt;script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"&gt;&lt;\/script&gt;\n","height":200,"media_domain_url":"https:\/\/www.redditmedia.com\/mediaembed\/yibnuy","scrolling":false,"width":350},"selftext":"","send_replies":false,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":39136,"subreddit_type":"public","suggested_sort":null,"thumbnail":"default","thumbnail_height":140,"thumbnail_width":140,"title":"My vision for Nreal Air AR glasses and iPad functionality. Plug the glasses into your iPad and the iPad becomes a keyboard + trackpad, allowing for multiple (up to 130”) screens on the go","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":1.0,"url":"https:\/\/twitter.com\/afox1984\/status\/1587065070210744323?s=46&amp;t=I6-Ak46wBzAPIigrqEk4bw","url_overridden_by_dest":"https:\/\/twitter.com\/afox1984\/status\/1587065070210744323?s=46&amp;t=I6-Ak46wBzAPIigrqEk4bw","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"Chris-P-Bois","author_created_utc":1565288369,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_4bu3fzto","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1660732595,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"wqlm1j","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#0dd3bb","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"e020c046-5957-11eb-84df-0e2254a55931","link_flair_text":"Question","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_wqlm1j","no_follow":false,"num_comments":1,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/wqlm1j\/looking_for_a_build_someone_created\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1662809751,"score":4,"secure_media":null,"secure_media_embed":{},"selftext":"Hi guys, I’m looking for an AR build someone created where when the user points their camera to the keyboard on their laptop it drops down and there’s an animated character inside it. Would greatly appreciate if someone could share the link with me.","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":37756,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Looking for a build someone created","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":1.0,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/wqlm1j\/looking_for_a_build_someone_created\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"heliophobicdude","author_created_utc":1430396162,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_n7mf0","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1660160424,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"wl6otp","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#646d73","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"00c8db46-595b-11eb-80c7-0efd43c355fd","link_flair_text":"Discussion","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_wl6otp","no_follow":true,"num_comments":2,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/wl6otp\/lets_talk_about_physical_portable_keyboard\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1662819816,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"Hiya! How can we solve speed and comfort for text input on XR devices?\n\nVirtual keyboards are quite slow and awkward. They bring peck typing to the XR. \n\nI’m not aware of any eye tracking keyboard inputs but I would imagine them being as limiting to single keystrokes at a time. \n\nIs there any work on physical keyboard input that can also be portable?\n\nOn handed keyboard come to mind but are also awkward and non portable. (E.g. Razer Tartarus, Azeron Cyborg)\n\nWhat are y’all’s thoughts?","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":37764,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Let’s talk about physical, portable keyboard","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":1.0,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/wl6otp\/lets_talk_about_physical_portable_keyboard\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"goingcryptoup","author_created_utc":1624487948,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_cwfp3nkq","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1657898676,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"vzrcx7","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#646d73","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"b08367c2-5956-11eb-8bec-0e2a5f45a149","link_flair_text":"Self Promotion","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_metadata":{"snkv9fa2xqb91":{"e":"Image","id":"snkv9fa2xqb91","m":"image\/png","p":[{"u":"https:\/\/preview.redd.it\/snkv9fa2xqb91.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=ed687af74654ee7938a4360d2fd296869e381b72","x":108,"y":108},{"u":"https:\/\/preview.redd.it\/snkv9fa2xqb91.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=5a936c07b2a493ffdf805a1416a10a3522c28700","x":216,"y":216},{"u":"https:\/\/preview.redd.it\/snkv9fa2xqb91.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=0637f5ff0647c0d3fbf17c017849c23caf3bfc04","x":320,"y":320},{"u":"https:\/\/preview.redd.it\/snkv9fa2xqb91.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=39c578f4b5a62c62005f079ba4615b0b0a437521","x":640,"y":640},{"u":"https:\/\/preview.redd.it\/snkv9fa2xqb91.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=c0e84d975f8fdd4f002c409fa6eecc553d1b6545","x":960,"y":960},{"u":"https:\/\/preview.redd.it\/snkv9fa2xqb91.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=63b7f84a1fb6b6b6ee2a3fa530ec14ef5f163cc6","x":1080,"y":1080}],"s":{"u":"https:\/\/preview.redd.it\/snkv9fa2xqb91.png?width=1668&amp;format=png&amp;auto=webp&amp;s=1ee468c4f9ea065cef6dc224999a827bdac51ef5","x":1668,"y":1668},"status":"valid"}},"media_only":false,"name":"t3_vzrcx7","no_follow":false,"num_comments":1,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/vzrcx7\/soundela_a_better_and_futuristic_way_to_learn\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1660040440,"score":83,"secure_media":null,"secure_media_embed":{},"selftext":"# \n\n[https:\\\/\\\/soundela.io\\\/](https:\/\/preview.redd.it\/snkv9fa2xqb91.png?width=1668&amp;format=png&amp;auto=webp&amp;s=1ee468c4f9ea065cef6dc224999a827bdac51ef5)\n\n# The Application\n\nSoundela is a Mixed Reality piano learning app for beginners, returners and advanced players who can learn songs in minutes and not weeks in a very fun and innovative way. It works for any kind of piano or keyboard. Players can choose between playing simple pieces with the help of a 3D notation system without reading notes or activate sheet music to really learn the song. Using this new technology, virtual notes are projected directly onto the real piano keyboard, creating an optimal environment for the player. On top of that Soundela aims to become a virtual music school teaching interactive lessons, learning technique, practice notes and chords interactively and receive instant feedback, music theory, composing own songs, improvisation and much more.\n\n**The Soundela Story**\n\nI started working on this project at the end of 2018 as part of my master thesis and have continued this project on and off with a few small breaks since then. Then in early 2020, one by one, I built a wonderful team with which I am still working on this project today. At this point, I was still starting with very inexpensive AR glasses and developed the first prototype for an Android phone with marker-based tracking. I realized relatively quickly that this would enable me to learn the piano in a new way. However, I realized more and more that I would not be able to cover all my needs with this marker-based AR technology, so I decided to switch to the Oculus Quest 2.\n\nFeel free to ask any and all question you might have in the comment section.\n\nHere is the official live demo from Soundela:- [https:\/\/www.youtube.com\/watch?v=Dgp3avoaLTA&amp;t](https:\/\/www.youtube.com\/watch?v=Dgp3avoaLTA&amp;t)\n\nVisite Our Official Website For More:- [https:\/\/soundela.io\/](https:\/\/soundela.io\/)","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":37267,"subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/L4fGitoKufirghIMEMTR9NEBmzTraXt4xGZAOGwoOKM.jpg","thumbnail_height":140,"thumbnail_width":140,"title":"SOUNDELA:- A better and futuristic way to learn piano","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.99,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/vzrcx7\/soundela_a_better_and_futuristic_way_to_learn\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"StartupJeeliz","author_created_utc":1521031059,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_97s0zp","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1650470087,"discussion_type":null,"distinguished":null,"domain":"webar.rocks","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"u7znsa","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":false,"is_video":false,"link_flair_background_color":"#ff66ac","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"94eceb5a-5956-11eb-bb91-0eee7720297f","link_flair_text":"OC Showcase","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_u7znsa","no_follow":true,"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/u7znsa\/webar_keyboard_detection_open_with_your_mobile\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1653994916,"retrieved_utc":1653994916,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":36258,"subreddit_type":"public","suggested_sort":null,"thumbnail":"default","thumbnail_height":null,"thumbnail_width":null,"title":"WebAR Keyboard detection: Open with your mobile and point the camera to a keyboard to spill coffee on it. Detection is made using a deep neural network with WebAR.rocks.object library (released on Github), rendering with THREE.js.","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.67,"url":"https:\/\/webar.rocks\/demos\/coffeeKeyboard\/","url_overridden_by_dest":"https:\/\/webar.rocks\/demos\/coffeeKeyboard\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"GregMadison","author_created_utc":1396651269,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_fzofk","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1647449671,"crosspost_parent":"t3_tfmhfe","crosspost_parent_list":[{"all_awardings":[{"award_sub_type":"GLOBAL","award_type":"global","awardings_required_to_grant_benefits":null,"coin_price":100,"coin_reward":0,"count":3,"days_of_drip_extension":null,"days_of_premium":null,"description":"Shows the Silver Award... and that's it.","end_date":null,"giver_coin_reward":null,"icon_format":null,"icon_height":512,"icon_url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_512.png","icon_width":512,"id":"gid_1","is_enabled":true,"is_new":false,"name":"Silver","penny_donate":null,"penny_price":null,"resized_icons":[{"height":16,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_16.png","width":16},{"height":32,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_32.png","width":32},{"height":48,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_48.png","width":48},{"height":64,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_64.png","width":64},{"height":128,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_128.png","width":128}],"resized_static_icons":[{"height":16,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_16.png","width":16},{"height":32,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_32.png","width":32},{"height":48,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_48.png","width":48},{"height":64,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_64.png","width":64},{"height":128,"url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_128.png","width":128}],"start_date":null,"static_icon_height":512,"static_icon_url":"https:\/\/www.redditstatic.com\/gold\/awards\/icon\/silver_512.png","static_icon_width":512,"subreddit_coin_reward":0,"subreddit_id":null,"tiers_by_required_awardings":null},{"award_sub_type":"GLOBAL","award_type":"global","awardings_required_to_grant_benefits":null,"coin_price":125,"coin_reward":0,"count":3,"days_of_drip_extension":null,"days_of_premium":null,"description":"When you come across a feel-good thing.","end_date":null,"giver_coin_reward":null,"icon_format":null,"icon_height":2048,"icon_url":"https:\/\/i.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png","icon_width":2048,"id":"award_5f123e3d-4f48-42f4-9c11-e98b566d5897","is_enabled":true,"is_new":false,"name":"Wholesome","penny_donate":null,"penny_price":null,"resized_icons":[{"height":16,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=16&amp;height=16&amp;auto=webp&amp;s=92932f465d58e4c16b12b6eac4ca07d27e3d11c0","width":16},{"height":32,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=32&amp;height=32&amp;auto=webp&amp;s=d11484a208d68a318bf9d4fcf371171a1cb6a7ef","width":32},{"height":48,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=48&amp;height=48&amp;auto=webp&amp;s=febdf28b6f39f7da7eb1365325b85e0bb49a9f63","width":48},{"height":64,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=64&amp;height=64&amp;auto=webp&amp;s=b4406a2d88bf86fa3dc8a45aacf7e0c7bdccc4fb","width":64},{"height":128,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=128&amp;height=128&amp;auto=webp&amp;s=19555b13e3e196b62eeb9160d1ac1d1b372dcb0b","width":128}],"resized_static_icons":[{"height":16,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=16&amp;height=16&amp;auto=webp&amp;s=92932f465d58e4c16b12b6eac4ca07d27e3d11c0","width":16},{"height":32,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=32&amp;height=32&amp;auto=webp&amp;s=d11484a208d68a318bf9d4fcf371171a1cb6a7ef","width":32},{"height":48,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=48&amp;height=48&amp;auto=webp&amp;s=febdf28b6f39f7da7eb1365325b85e0bb49a9f63","width":48},{"height":64,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=64&amp;height=64&amp;auto=webp&amp;s=b4406a2d88bf86fa3dc8a45aacf7e0c7bdccc4fb","width":64},{"height":128,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png?width=128&amp;height=128&amp;auto=webp&amp;s=19555b13e3e196b62eeb9160d1ac1d1b372dcb0b","width":128}],"start_date":null,"static_icon_height":2048,"static_icon_url":"https:\/\/i.redd.it\/award_images\/t5_22cerq\/5izbv4fn0md41_Wholesome.png","static_icon_width":2048,"subreddit_coin_reward":0,"subreddit_id":null,"tiers_by_required_awardings":null},{"award_sub_type":"GLOBAL","award_type":"global","awardings_required_to_grant_benefits":null,"coin_price":100,"coin_reward":0,"count":1,"days_of_drip_extension":null,"days_of_premium":null,"description":"I'm genuinely flabbergasted.","end_date":null,"giver_coin_reward":null,"icon_format":"PNG","icon_height":2048,"icon_url":"https:\/\/i.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png","icon_width":2048,"id":"award_fbe9527a-adb3-430e-af1a-5fd3489e641b","is_enabled":true,"is_new":false,"name":"Shocked","penny_donate":null,"penny_price":0,"resized_icons":[{"height":16,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=16&amp;height=16&amp;auto=webp&amp;s=36f008595706cfff9ef6d1fdd06ae5353474471b","width":16},{"height":32,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=32&amp;height=32&amp;auto=webp&amp;s=b1e37f10d35059cc2ac41356073420b41a429d75","width":32},{"height":48,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=48&amp;height=48&amp;auto=webp&amp;s=c0cc6ae54fbf3e94516aaacef918834fd12030b3","width":48},{"height":64,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=64&amp;height=64&amp;auto=webp&amp;s=ee6a20be9f41b0e203fff64eb47cb5674e22daa6","width":64},{"height":128,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=128&amp;height=128&amp;auto=webp&amp;s=38ac24a33777a7fc3e77f68836c150daf7cb4aa4","width":128}],"resized_static_icons":[{"height":16,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=16&amp;height=16&amp;auto=webp&amp;s=36f008595706cfff9ef6d1fdd06ae5353474471b","width":16},{"height":32,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=32&amp;height=32&amp;auto=webp&amp;s=b1e37f10d35059cc2ac41356073420b41a429d75","width":32},{"height":48,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=48&amp;height=48&amp;auto=webp&amp;s=c0cc6ae54fbf3e94516aaacef918834fd12030b3","width":48},{"height":64,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=64&amp;height=64&amp;auto=webp&amp;s=ee6a20be9f41b0e203fff64eb47cb5674e22daa6","width":64},{"height":128,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png?width=128&amp;height=128&amp;auto=webp&amp;s=38ac24a33777a7fc3e77f68836c150daf7cb4aa4","width":128}],"start_date":null,"static_icon_height":2048,"static_icon_url":"https:\/\/i.redd.it\/award_images\/t5_22cerq\/fck3iedi2ug51_Shocked.png","static_icon_width":2048,"subreddit_coin_reward":0,"subreddit_id":null,"tiers_by_required_awardings":null}],"allow_live_comments":true,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"GregMadison","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_fzofk","author_is_blocked":false,"author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_at_utc":null,"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1647449422.0,"created_utc":1647449422.0,"discussion_type":null,"distinguished":null,"domain":"v.redd.it","downs":0,"edited":false,"gilded":0,"gildings":{"gid_1":3},"hidden":false,"hide_score":false,"id":"tfmhfe","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":true,"is_robot_indexable":true,"is_self":false,"is_video":true,"likes":null,"link_flair_background_color":"#edeff1","link_flair_css_class":"","link_flair_richtext":[{"e":"text","t":"Self-Promotion (Developer)"}],"link_flair_template_id":"0bb1b1c4-e619-11e9-873d-0e5f7a8c8790","link_flair_text":"Self-Promotion (Developer)","link_flair_text_color":"dark","link_flair_type":"richtext","locked":false,"media":{"reddit_video":{"bitrate_kbps":4800,"dash_url":"https:\/\/v.redd.it\/moofczt2zrn81\/DASHPlaylist.mpd?a=1656655095%2CODNjNTBlZDQ5MjdhMDQwYmJmYjk2NjZmNjg4YTM5NTkyNDMwMzVkZTBiN2M2NTU5NGM5ODNjYTkyZmUwYWJkNA%3D%3D&amp;v=1&amp;f=sd","duration":59,"fallback_url":"https:\/\/v.redd.it\/moofczt2zrn81\/DASH_1080.mp4?source=fallback","height":1080,"hls_url":"https:\/\/v.redd.it\/moofczt2zrn81\/HLSPlaylist.m3u8?a=1656655095%2COWVjODAxNzlkZGM4NmU3ZWY4YWMyOGI3NjAzYjc3YjIxZmEyZjBhZTEyMzc3MDFkY2QwYzIxMjc1Y2IxZjQyOA%3D%3D&amp;v=1&amp;f=sd","is_gif":false,"scrubber_media_url":"https:\/\/v.redd.it\/moofczt2zrn81\/DASH_96.mp4","transcoding_status":"completed","width":1920}},"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_tfmhfe","no_follow":false,"num_comments":260,"num_crossposts":5,"num_reports":null,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/OculusQuest\/comments\/tfmhfe\/in_the_metaverse_computers_are_semivirtual\/","pinned":false,"post_hint":"hosted:video","preview":{"enabled":false,"images":[{"id":"tMJW0i9aFUM5bfyy3Bfnr3MP4ut0SJfU3jyLPPp9_d0","resolutions":[{"height":60,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=108&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=d15f2cc2a3c2cdd5dd983dc11166bbcfac135ef0","width":108},{"height":121,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=216&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=7677cec617b982ceae3b8091cb13498d4c05fb5e","width":216},{"height":180,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=320&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=00a9092ca5f344c3a0910acf6efad2ab5d9e168f","width":320},{"height":360,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=640&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=55a9ab900b1a9f136558d4a0f6cfbf8528890efc","width":640},{"height":540,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=960&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=203326ff9a32b73612cc5c98a254d2c2136681bd","width":960},{"height":607,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=1080&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=a92311d14effab468d2d34a505edc949a8d9ac26","width":1080}],"source":{"height":1080,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?format=pjpg&amp;auto=webp&amp;s=5d2eb6a13f07aa78ce2b6447d0413f7b39f59930","width":1920},"variants":{}}]},"pwls":6,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":null,"report_reasons":null,"saved":false,"score":1909,"secure_media":{"reddit_video":{"bitrate_kbps":4800,"dash_url":"https:\/\/v.redd.it\/moofczt2zrn81\/DASHPlaylist.mpd?a=1656655095%2CODNjNTBlZDQ5MjdhMDQwYmJmYjk2NjZmNjg4YTM5NTkyNDMwMzVkZTBiN2M2NTU5NGM5ODNjYTkyZmUwYWJkNA%3D%3D&amp;v=1&amp;f=sd","duration":59,"fallback_url":"https:\/\/v.redd.it\/moofczt2zrn81\/DASH_1080.mp4?source=fallback","height":1080,"hls_url":"https:\/\/v.redd.it\/moofczt2zrn81\/HLSPlaylist.m3u8?a=1656655095%2COWVjODAxNzlkZGM4NmU3ZWY4YWMyOGI3NjAzYjc3YjIxZmEyZjBhZTEyMzc3MDFkY2QwYzIxMjc1Y2IxZjQyOA%3D%3D&amp;v=1&amp;f=sd","is_gif":false,"scrubber_media_url":"https:\/\/v.redd.it\/moofczt2zrn81\/DASH_96.mp4","transcoding_status":"completed","width":1920}},"secure_media_embed":{},"selftext":"","selftext_html":null,"send_replies":true,"spoiler":false,"stickied":false,"subreddit":"OculusQuest","subreddit_id":"t5_p2wzd","subreddit_name_prefixed":"r\/OculusQuest","subreddit_subscribers":362053,"subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/_cBj-M8F4iEE54oR4QXUu5hu8rWPT1xKUWrU6koRP9o.jpg","thumbnail_height":78,"thumbnail_width":140,"title":"In the Metaverse computers are semi-virtual - Augmented Keyboard - Meta Quest 2","top_awarded_type":null,"total_awards_received":7,"treatment_tags":[],"ups":1909,"upvote_ratio":0.95,"url":"https:\/\/v.redd.it\/moofczt2zrn81","url_overridden_by_dest":"https:\/\/v.redd.it\/moofczt2zrn81","user_reports":[],"view_count":null,"visited":false,"whitelist_status":"all_ads","wls":6}],"discussion_type":null,"distinguished":null,"domain":"v.redd.it","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"tfmkmr","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":true,"is_robot_indexable":true,"is_self":false,"is_video":false,"link_flair_background_color":"#7193ff","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"d634b96c-5956-11eb-82e4-0edbacc3d4db","link_flair_text":"Concept Design","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_tfmkmr","no_follow":false,"num_comments":3,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/tfmkmr\/in_the_metaverse_computers_are_semivirtual\/","pinned":false,"post_hint":"link","preview":{"enabled":false,"images":[{"id":"tMJW0i9aFUM5bfyy3Bfnr3MP4ut0SJfU3jyLPPp9_d0","resolutions":[{"height":60,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=19add087187c48ec8237b217f86659245babff5a","width":108},{"height":121,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=b8a23867480cb5e49888b83cecfe823fe54b25ad","width":216},{"height":180,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=30ff6f1f9fdf9943dce93529d0d074049df8589d","width":320},{"height":360,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=de0ef232330087784489e22ba7abcc2ede896cad","width":640},{"height":540,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=960&amp;crop=smart&amp;auto=webp&amp;s=825b58492f7f734b4ee0116584237fa97e792c72","width":960},{"height":607,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?width=1080&amp;crop=smart&amp;auto=webp&amp;s=2dab2b9d7006a5513872f8614948c7506126206c","width":1080}],"source":{"height":1080,"url":"https:\/\/external-preview.redd.it\/juuJBPB1cDflSw9CDnRs0AYurkh7kn3ksLWAiSrlHdY.png?auto=webp&amp;s=1a17d3823a5a9be519de824ebf29e6e0c495f053","width":1920},"variants":{}}]},"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1654063096,"retrieved_utc":1654063096,"score":27,"secure_media":null,"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":36263,"subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/_cBj-M8F4iEE54oR4QXUu5hu8rWPT1xKUWrU6koRP9o.jpg","thumbnail_height":78,"thumbnail_width":140,"title":"In the Metaverse computers are semi-virtual - Augmented Keyboard - Meta Quest 2","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.86,"url":"https:\/\/v.redd.it\/moofczt2zrn81","url_overridden_by_dest":"https:\/\/v.redd.it\/moofczt2zrn81","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"TotalWaffle","author_created_utc":1374597881,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_chg5i","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1644791490,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"srux6a","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#646d73","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"00c8db46-595b-11eb-80c7-0efd43c355fd","link_flair_text":"Discussion","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_srux6a","no_follow":false,"num_comments":8,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/srux6a\/ar_anime_dennoh_coil_on_us_netflix\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1654118953,"retrieved_utc":1654118953,"score":14,"secure_media":null,"secure_media_embed":{},"selftext":"This series came out in 2007, and never got a US release until now. Anyone interested in AR should watch it.\n\nAll the characters wear AR glasses, and virtual space overlays reality.  Each episode shows the use of varied AR applications- any one of which could be a startup in the upcoming real world AR market.  \n\nThere are virtual pets, helper creatures, roving antivirus bots that repair damaged virtual space and destroy ‘illegal’ items, floating displays and virtual keyboards, instant walls, meta tags that look like literal paper slips, portals for items, and much more. Some serious thought went into this production.  \n\nEpisode 4 is notable for an AR battle between the characters with a variety of virtual weapons and simulated hacking techniques- and if you lose, your glasses lose all their data!\n\nI can imagine that many of you will be grinning from ear to ear watching this show, and now you all have something to show people that demonstrates what AR could be like.","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":36270,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"AR anime ‘Den-Noh Coil’ on US Netflix","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.94,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/srux6a\/ar_anime_dennoh_coil_on_us_netflix\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[{"award_sub_type":"GLOBAL","award_type":"global","awardings_required_to_grant_benefits":null,"coin_price":50,"coin_reward":0,"count":1,"days_of_drip_extension":null,"days_of_premium":null,"description":"I'm in this with you.","end_date":null,"giver_coin_reward":null,"icon_format":"PNG","icon_height":2048,"icon_url":"https:\/\/i.redd.it\/award_images\/t5_q0gj4\/p4yzxkaed5f61_oldtakemyenergy.png","icon_width":2048,"id":"award_02d9ab2c-162e-4c01-8438-317a016ed3d9","is_enabled":true,"is_new":false,"name":"Take My Energy","penny_donate":null,"penny_price":0,"resized_icons":[{"height":16,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/p4yzxkaed5f61_oldtakemyenergy.png?width=16&amp;height=16&amp;auto=webp&amp;s=10034f3fdf8214c8377134bb60c5b832d4bbf588","width":16},{"height":32,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/p4yzxkaed5f61_oldtakemyenergy.png?width=32&amp;height=32&amp;auto=webp&amp;s=100f785bf261fa9452a5d82ee0ef0793369dbfa5","width":32},{"height":48,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/p4yzxkaed5f61_oldtakemyenergy.png?width=48&amp;height=48&amp;auto=webp&amp;s=b15d030fdfbbe4af4a5b34ab9dc90a174df40a23","width":48},{"height":64,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/p4yzxkaed5f61_oldtakemyenergy.png?width=64&amp;height=64&amp;auto=webp&amp;s=601c75be6ee30dc4b47a5c65d64dea9a185502a1","width":64},{"height":128,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/p4yzxkaed5f61_oldtakemyenergy.png?width=128&amp;height=128&amp;auto=webp&amp;s=540f36e65c0e2f1347fe32020e4a1565e3680437","width":128}],"resized_static_icons":[{"height":16,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/jtw7x06j68361_TakeMyEnergyElf.png?width=16&amp;height=16&amp;auto=webp&amp;s=045db73f47a9513c44823d132b4c393ab9241b6a","width":16},{"height":32,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/jtw7x06j68361_TakeMyEnergyElf.png?width=32&amp;height=32&amp;auto=webp&amp;s=298a02e0edbb5b5e293087eeede63802cbe1d2c7","width":32},{"height":48,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/jtw7x06j68361_TakeMyEnergyElf.png?width=48&amp;height=48&amp;auto=webp&amp;s=7d06d606eb23dbcd6dbe39ee0e60588c5eb89065","width":48},{"height":64,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/jtw7x06j68361_TakeMyEnergyElf.png?width=64&amp;height=64&amp;auto=webp&amp;s=ecd9854b14104a36a210028c43420f0dababd96b","width":64},{"height":128,"url":"https:\/\/preview.redd.it\/award_images\/t5_q0gj4\/jtw7x06j68361_TakeMyEnergyElf.png?width=128&amp;height=128&amp;auto=webp&amp;s=0d5d7b92c1d66aff435f2ad32e6330ca2b971f6d","width":128}],"start_date":null,"static_icon_height":2048,"static_icon_url":"https:\/\/i.redd.it\/award_images\/t5_q0gj4\/jtw7x06j68361_TakeMyEnergyElf.png","static_icon_width":2048,"subreddit_coin_reward":0,"subreddit_id":null,"tiers_by_required_awardings":null},{"award_sub_type":"PREMIUM","award_type":"global","awardings_required_to_grant_benefits":null,"coin_price":30,"coin_reward":0,"count":1,"days_of_drip_extension":null,"days_of_premium":null,"description":"A golden splash of respect","end_date":null,"giver_coin_reward":null,"icon_format":null,"icon_height":2048,"icon_url":"https:\/\/i.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png","icon_width":2048,"id":"award_a2506925-fc82-4d6c-ae3b-b7217e09d7f0","is_enabled":true,"is_new":false,"name":"Narwhal Salute","penny_donate":null,"penny_price":null,"resized_icons":[{"height":16,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=16&amp;height=16&amp;auto=webp&amp;s=4e475e8c3265ec7148d7f4204f07d33949482f21","width":16},{"height":32,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=32&amp;height=32&amp;auto=webp&amp;s=42e32a4b9f1e70791716c3be283e89951e212a69","width":32},{"height":48,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=48&amp;height=48&amp;auto=webp&amp;s=5adb621fede4e8e66b952a379ad038fcc1b8ad13","width":48},{"height":64,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=64&amp;height=64&amp;auto=webp&amp;s=6161edea19569bbee73ef322a2e5470535ec1787","width":64},{"height":128,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=128&amp;height=128&amp;auto=webp&amp;s=5d2c75f44f176f430e936204f9a53b8a2957f2fc","width":128}],"resized_static_icons":[{"height":16,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=16&amp;height=16&amp;auto=webp&amp;s=4e475e8c3265ec7148d7f4204f07d33949482f21","width":16},{"height":32,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=32&amp;height=32&amp;auto=webp&amp;s=42e32a4b9f1e70791716c3be283e89951e212a69","width":32},{"height":48,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=48&amp;height=48&amp;auto=webp&amp;s=5adb621fede4e8e66b952a379ad038fcc1b8ad13","width":48},{"height":64,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=64&amp;height=64&amp;auto=webp&amp;s=6161edea19569bbee73ef322a2e5470535ec1787","width":64},{"height":128,"url":"https:\/\/preview.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png?width=128&amp;height=128&amp;auto=webp&amp;s=5d2c75f44f176f430e936204f9a53b8a2957f2fc","width":128}],"start_date":null,"static_icon_height":2048,"static_icon_url":"https:\/\/i.redd.it\/award_images\/t5_22cerq\/80j20o397jj41_NarwhalSalute.png","static_icon_width":2048,"subreddit_coin_reward":0,"subreddit_id":null,"tiers_by_required_awardings":null}],"allow_live_comments":false,"archived":false,"author":"RedEagle_MGN","author_created_utc":1474424434,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_11k30x","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1644244273,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"smrlho","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#646d73","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"00c8db46-595b-11eb-80c7-0efd43c355fd","link_flair_text":"Discussion","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_smrlho","no_follow":false,"num_comments":8,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/smrlho\/its_heartbreaking_to_see_cryptonfts_destroy\/","pinned":false,"post_hint":"self","preview":{"enabled":false,"images":[{"id":"w7Q-E3eJTBRXdYFB345bYHpGFNCkYY3rhlZPRJnf7DE","resolutions":[{"height":81,"url":"https:\/\/external-preview.redd.it\/VygvZ7hn5YctQStGsjlNLck69jM1XZW8xwRJjTa4sG0.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=be8898f078265020cb80ecfd7a8c37c7ac4b3467","width":108},{"height":162,"url":"https:\/\/external-preview.redd.it\/VygvZ7hn5YctQStGsjlNLck69jM1XZW8xwRJjTa4sG0.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=915519c1d9c08bba92378f3396a884d70bf68f3d","width":216},{"height":240,"url":"https:\/\/external-preview.redd.it\/VygvZ7hn5YctQStGsjlNLck69jM1XZW8xwRJjTa4sG0.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=951398d5abd585c2dcecd3ae481963651da36b11","width":320}],"source":{"height":360,"url":"https:\/\/external-preview.redd.it\/VygvZ7hn5YctQStGsjlNLck69jM1XZW8xwRJjTa4sG0.jpg?auto=webp&amp;s=73bc482ea9e9a9ddda0a71bb29555b2fa11395ac","width":480},"variants":{}}]},"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1654130926,"retrieved_utc":1654130926,"score":31,"secure_media":null,"secure_media_embed":{},"selftext":"Audio instead: [https:\/\/youtu.be\/I5ao5AwZLZY](https:\/\/youtu.be\/I5ao5AwZLZY)\n\nFor the last 8 and 1\/2 years I've been studying what it would take to make virtual worlds accessible, and meaningful to the average person. Ever since Facebook changed its name to Meta, my entire industry has been redubbed “[The Metaverse](https:\/\/www.reddit.com\/r\/MetaverseOpen\/comments\/smqs79\/introduction_to_the_metaverse\/).”\n\nIt was, at first, fascinating to see how many other people are passionate about the idea of virtual worlds playing an important role in everyday life, but then, everything changed. Tens of thousands of people began to show up in the places we would chat, shilling crypto coins and NFTs.\n\nInitially, I was curious, and I saw that there were many massive companies investing in the technology, however, I fundamentally didn't understand how all these people would pull off their ideals of a people-first, decentralized “Web3.”\n\nI thought to myself, “they're probably just a lot smarter than I am.” After all, with so many massive companies investing, I probably just didn’t understand.\n\nSo I began to study and ask questions:\n\n* If anyone can create a virtual world, what makes NFT land scarce?\n* If NFTs will indeed be used for a large interoperable Metaverse, how would different virtual world creators integrate them?\n* And many more.\n\nThe more I asked questions, the less answers I found…\n\nthe deeper I dug, the more disturbed I became.\n\n&amp;#x200B;\n\nRather than having real answers, NFT enthusiasts responded to my questions with oddities:\n\n“Don’t listen to the FUD Fear, Uncertainty and Doubt” they would say and\n\n“Believe in the principles, don’t worry about the details.”\n\nI could see that they were star-struck, guided along by an unmoving faith in ideals.\n\nHowever, very few people had real answers, they just assumed someone else had fingered it out.\n\nBut why would so many people choose to close their eyes and plug their ears? Isn't the entirety of western civilization built on fear, uncertainty and doubt? Isn't asking questions how we got here?\n\nSo I began to study…\n\n# What sort of future does Web3 pitch?\n\nFirst we need to understand what the prophets of Web3 preach:\n\n**Decentralization &amp; privacy:**  A world where we will be in charge of our own identity and security in order to take back control from the Web2 giants like Facebook and Google.\n\n**An open interoperable Metaverse:** Namely, that the future of the internet is a group of large interoperable connected virtual worlds in which anyone can create items which many of those worlds will be able to use.\n\n**Individual monetary control:** People being able to use the crypto currency they believe in.\n\n&amp;#x200B;\n\n# Ideals examined\n\n**Decentralization:**\n\nAdam Smith explained that as economies develop, skilled individuals specialize in smaller and smaller particular skills in order to increase their own efficiency. Whereas one person could create an entire watch, it was much more efficient for one person to focus entirely on the hands of the watch and the other on the gears of the watch.\n\nIn Web1, we all ran our own websites on our own servers and we all learned code in order to publish content on them. In Web2, hosting companies managed our servers, services managed our publishing and our identity and security were handled by them. Each company specialized in providing a service to the users and was dedicated to that service alone.\n\nWeb3 imagines a world which contradicts this flow. We would once again be in charge of our own identity, security, publishing and hosting. What Web3 advocates seem to miss is that Web2 was a natural improvement on Web1and that the pitch of Web3 has customer priorities the wrong way around. People want usability and people don't pay for privacy. After all, the masses put microphone\/camera\/GPS combs in thier pocket because it helped them get more Facebook\/Instagram time.\n\nMy exploration in these matters has even caused me to question the viability of blockchain technology, wallets and addresses as being fundamental to the future.\n\n&amp;#x200B;\n\n**Privacy:**\n\nOne of the reasons Web3 is touted as the future is that we will be in control of our data. However, I've noticed that this decentralization, so far, has only led to more companies being able to see our data. Now with blockchain being an open, visible, immutable  database, it’s a total nightmare for privacy. Anyone can see what we own, and who we connect with. Moreover, because the blockchain is immutable, anyone can send a picture of our front door to our address and now everyone has that data. Just imagine a world in which your nude photos are sent to your wallet address? Web1 decentralization had a negative impact on privacy, why would Web3 be different?\n\nIn thought, the ideal is noble, but in practice Web3, so far, is the worst possible outcome for privacy.\n\n&amp;#x200B;\n\n**NFT interoperability:**\n\nI can't even begin to list the number of issues with this idea:\n\n* **Style**: Each virtual world in the greater Metaverse will have a different style, this means an NFT sword from one world simply won't work in another world. Changing the style is pretty much like making the item new. Trying to do this at scale with thousands of items is totally ridiculous.\n* **Balance**: The virtual worlds of the future will include some sort of gameplay and breaking that gameplay by introducing thousands of unbalanced items is a bad idea.\n* **Economy**: Each virtual world creator will be financially incentivized not to allow in the greater ecosystem of the interoperable Metaverse because if they do they will undercut their own profits and their ability to sell their own items. Those who suggest that this will be ideal for marketing efforts misunderstand why people adopt virtual worlds in the first place.\n* **Fit**: Most people are unaware that everything in a virtual world is bespokely fit to most other things in it. The size of doors is carefully mapped to the size of hats you can put on. The size of a backpack that you can wear is carefully crafted to make sure you don't clip through the chairs you sit on. Unless you imagine a world in which everybody is clipping through everything in a jarring immersion-breaking experience it's just not going to work.\n\n&amp;#x200B;\n\n**Virtual world interoperability:**\n\nThe idea of NFTs are predicated on an idea of a large interoperable Metaverse. We should keep in mind that the Metaverse has existed for more than 18 years via platforms like Second Life and that the masses never adopted the technology. I sincerely believe this is because of its lack of practicality in solving everyday problems and it's unusability to the average person.\n\nHere are some of the issues an interoperable Metaverse faces:\n\n**1) Controls**: A truly decentralized Metaverse cannot impose standards on all participants. Just imagine a world in which every virtual world creator sets their own controls. One person will use the arrow keys, another wasd, another mouse movement. It's absurd to think that every time someone will pass from one place to another they will have to learn a new set of controls.\n\nThose who are reading this must remember that we are the 1% of computer users. Chrome added a copy and paste feature for those who did not understand how to do this via their keyboard and most are confused by how even something like Facebook works.\n\n**2) Standards**: In my study of how people interact with virtual worlds, they see themselves as standing next to a big red button, that if they push it, it will blow up everything. People are terrified of what they don't understand.\n\nIn the Metaverse, there are real consequences to not understanding, for example, which button unmutes you, if you are talking to a human or NPC, what happens if you fall off this sky island etc. etc. Having to relearn everything about life every time you enter a world is absurd. However, that’s how Web1 worked, a new UI for every website and space. I believe the lack of usability is one of the reasons average people stopped, in large part, using the greater web and focusing in on platforms like Facebook, Reddit and Instagram.\n\nWeb3 is proposing we run this backwards in the name of freedom and privacy with no clear path and no particle examples on how to do this.\n\n**3) The leaky tap**: When everything is interoperable, it's really hard to advance a standard. One example is email, we've been struggling to get email to be encrypted for a very long time because everyone has to adopt the same standards to make it work. This same problem will put an interoperable series of virtual worlds far behind a unified experience.\n\n**4) Customization**: Individual virtual world creators are very likely to see how the virtual world should work in different ways. I sincerely believe that humanoid avatars are key but other people are intent on allowing people to dress up as animals. With that sort of diversity the understandability of the Metaverse will be very low and make large-scale adoption a challenge.\n\n**5) Traversal**: At some point a single virtual world platform is likely to amass a large number of users for one reason or another. This would give them the opportunity to engage in sizable (30%) platform fees like Google and Apple do with the App Store. If one world gains the familiarity of hundreds of millions of users would they be highly incentivised to share that traffic with everyone else? If a large portion of the population of the Metaverse becomes familiar with 1 platform, aren't they more likely to coalesce on that platform due to the fact that they've already put in the effort to understand it? IMHO the idea that one platform will get a bulk of the users and share them is unlikely.\n\nAll of these points stand in opposition to a large interoperable Metaverse, upon which the value of NFTs is predicated, and they also make a centralized situation more likely. If a centralized uniform Metaverse is to appear, will it give up it’s right to massive platform fees to allow in NFTs without those NFT holders paying a massive tax? The NFTs would undermine one of the platform’s most lucrative markets.\n\n**Individual monetary control:**\n\n\\*Note: There are probably more qualified people here who can comment on this.\\*\n\nInternational trade often transacts through the United States. The United States is the home of a global reserve currency which everyone needs and everyone uses and is the standard to most economic functions of the modern world. Ever since moving off the gold standard the United States has the ability to print a very large quantity of money and use this as a subtle global tax on those who use the US dollar. Since the US dollar has a global demand, printing huge quantities is easy since the impact is spread out across the whole world.\n\nThe true value of a currency is in the goods that can be traded in that currency. As long as everything goes through the US, the US can keep printing. However, if a viable alternative is found, the US will no longer be able to tax the world.\n\nSome interesting facts highlighted by Jake Tran: [https:\/\/youtu.be\/1TPuBmuYa18](https:\/\/youtu.be\/1TPuBmuYa18)\n\nWatch that video.\n\nThere's a lot I'd like to say on this topic but I don't feel entirely comfortable doing it but I will highlight 2 points:\n\nWhen the United States saw gold as an issue, they used  Executive Order 6102 in 1933 to force US citizens to trade gold for cash.\n\nWhen Facebook, known for its massive user base and usable products tried to create a crypto anyone could use, it was shut down as fast as lightning.\n\nSo if the government can stop people even owning gold at will, what stops them from stopping bitcoin or ethereum? If the government could shut down Facebook's crypto so quickly, why couldn’t it shut these down?\n\nWhat if they understood crypto was so broken that they don’t see it as a threat? What if the gas fees, unstable price and total lack of usability by the average user was so bad, the US does not fear it?\n\nThere is a lot more to crypto than functional currency use but I am only addressing that one subject.\n\nI have \\*much\\* more to say but cannot say it here.\n\n# Conclusion\n\nThose of us who work in the virtual world industry are dealing with a whole new paradigm of human behavior. Many of these crypto and Metaverse projects strongly incentivize those who buy in to blindly shill a product without scrutiny as everyone is looking for a bigger buyer to buy their “land” or “currency”.\n\nThis new marketing paradigm combined with social media amplification and bot-driven spam is something we as a human species are going to have to wrestle with.\n\nHere is what I believe we need to do:\n\n1. Ask questions, don’t believe other people have figured it out.\n2. Don’t judge and condemn people for being adjacent to crypto or the Metaverse. Seriously, we must stop banning these conversations on platforms\/subreddits as that creates a bigger echo chamber.\n3. Don't advocate for something you have a deep financial interest in without disclosing that. It’s deeply unethical.\n4. No one has a monopoly on truth. We cannot follow the herd whether it is for or against Web3\/Crypto. We must think for ourselves and be willing to share our thoughts to have them challenged.\n\n# Taking Action\n\nI'd love to team up with people who believe in a people-first Metaverse to create a future that focuses on truly solving problems. I believe spacial computing will make a mass-adoptable Metaverse possible but there's a high chance the space will be dominated by a single company (based on my above analysis). This company will end up being responsible for our speech and therefore will be forced to use our data to censor us, sometimes in advance, like Facebook does on it's platform today.\n\nIf the Metaverse if the future of how we live, we need to avoid that outcome at all costs. [Email me](https:\/\/form.jotform.com\/220367849573063) if you want to help out in this vision. Right now I am looking to content with developers, project managers and just regular helpers who want to be part.\n\n# Response\n\nI would like to hear your honest questions and thoughts about blockchain, the Metaverse and the points I have brought up so far. No matter what side of this debate you're on, I value your opinion.\n\n#","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":36270,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"It’s heartbreaking to see crypto\/NFTs destroy something I love","top_awarded_type":null,"total_awards_received":2,"treatment_tags":[],"upvote_ratio":0.82,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/smrlho\/its_heartbreaking_to_see_cryptonfts_destroy\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"iMattDaGreat","author_created_utc":1594320594,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_77wy1xrm","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1640201633,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"rmcv0e","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#0dd3bb","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"e020c046-5957-11eb-84df-0e2254a55931","link_flair_text":"Question","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_rmcv0e","no_follow":false,"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/rmcv0e\/how_to_make_an_ar_keyboard\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1656061345,"retrieved_utc":1656061345,"score":2,"secure_media":null,"secure_media_embed":{},"selftext":"I’m working on a smart glass project and want to create an interactive keyboard that tries to stay at its current location, even with head movement. How should I go about this? I’m gonna run Linux on this device if that info helps.","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":36601,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"How to make an AR keyboard","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":0.75,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/rmcv0e\/how_to_make_an_ar_keyboard\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"UCFSTORMTROOPER","author_created_utc":1364358011,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_b39no","author_patreon_flair":false,"author_premium":false,"awarders":[],"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1630370206,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"pev0sd","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#0dd3bb","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"e020c046-5957-11eb-84df-0e2254a55931","link_flair_text":"Question","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_pev0sd","no_follow":false,"num_comments":1,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/pev0sd\/ar_concept_use\/","pinned":false,"pwls":6,"quarantine":false,"removed_by":null,"removed_by_category":null,"retrieved_on":1656166902,"retrieved_utc":1656166902,"score":2,"secure_media":null,"secure_media_embed":{},"selftext":"wasn’t sure of a good title but wanted to discuss a personal project use for ar using ar glasses and if the technology exists. \n\nI want to preface this with is have 0 experience or knowledge of current AR software and hardware limitations. \n\nOn to what I have on my mind. \n\nCan ar glasses recognize things like an arm or hand? Assuming the glasses are connected to a phone and have some sort of camera built in, could you expect making a camera clicking gesture be picked up to initiate the camera to take a picture? Or if you get a call\/text that pops into your field of view and look to your arm, a controller would pop up to allow you to give preset replies or have a keyboard appear? \n\nObviously this would take software design to get the exact things to happen but is the technology here to accomplish this?\n\nI am more looking for a behind the lense projector rather than like the google glass having it in front of the lense. \n\nBulkiness isnt an issue as this is more of a fun helmet design\/ proof of concept.","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":36613,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"AR concept use","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":1.0,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/pev0sd\/ar_concept_use\/","view_count":null,"whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"VisibleAir7","author_created_utc":1560784940,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_3ydlz23x","author_patreon_flair":false,"author_premium":false,"can_gild":true,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1621067791,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":1621068736.0,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"ncu67b","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#0dd3bb","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"e020c046-5957-11eb-84df-0e2254a55931","link_flair_text":"Question","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_ncu67b","no_follow":false,"num_comments":8,"num_crossposts":1,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/ncu67b\/which_framework_should_i_use_to_create_an_ar\/","pinned":false,"pwls":6,"quarantine":false,"removed_by_category":null,"retrieved_utc":1623507159,"score":4,"secure_media":null,"secure_media_embed":{},"selftext":"Hi,\n\nI want to create an APP (Android) that is able to scan an object (of the size of a computer keyboard) using the smartphone camera and apply 3d and 2d augments to it. After that whenever I move the camera on the object I want to see the augments I have placed.\n\nIn other words, scanning the object and adding augments should be both done in the app.\n\nCan all of this be done on the smartphone device or does the computation of feature points require bigger hardware? I never worked with AR before.\n\nWhich framework\/SDK would fit best for such an app?\n\n I guess Unity is the way to go to create interactive 3d stuff?\n\n&amp;#x200B;\n\nI have read the AR Foundation and vuforia are the big players for this kind of applications but from what I have found out vuforia has a separate scanner app which is not part of the SDK so scanning and tracking cannot be done in one app? ","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_subscribers":28393,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Which framework should I use to create an AR object scanner?","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":1.0,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/ncu67b\/which_framework_should_i_use_to_create_an_ar\/","whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"njtrafficsignshopper","author_created_utc":1268122250,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_3xgey","author_patreon_flair":false,"author_premium":false,"can_gild":true,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1610777085,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"kyddy2","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"#0dd3bb","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"e020c046-5957-11eb-84df-0e2254a55931","link_flair_text":"Question","link_flair_text_color":"light","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_kyddy2","no_follow":false,"num_comments":4,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/kyddy2\/mad_gaze_glow_as_monitor_replacement\/","pinned":false,"pwls":6,"quarantine":false,"removed_by_category":null,"retrieved_utc":1623348471,"score":3,"secure_media":null,"secure_media_embed":{},"selftext":"Has anyone gotten their hands on one yet? I am wondering how practical it might be to just hook these up to a laptop.\n\nI work as a programmer and am staring at the screen all day. I am brainstorming some ideas for ergonomic improvements and my research on wearable displays led me to this device which seems like the frontrunner out of the commercially available consumer devices so far.\n\nAnother idea, once we can actually get out and about again, might be to hook it up to a small computer like a Pi and use that as laptop replacement. Especially with a keyboard replacement like Tap..?\n\nBut one step at a time, for now. Is this thing usable for hours? How is the display quality and comfort?","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_subscribers":28363,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Mad Gaze Glow as monitor replacement?","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":1.0,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/kyddy2\/mad_gaze_glow_as_monitor_replacement\/","whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":true,"author":"goprogamer321","author_created_utc":1576024538,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_4ko8w0qp","author_patreon_flair":false,"author_premium":false,"can_gild":true,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1602294190,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"j8bwdi","is_created_from_ads_ui":false,"is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"name":"t3_j8bwdi","no_follow":true,"num_comments":14,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/j8bwdi\/ar_keyboard\/","pinned":false,"pwls":6,"quarantine":false,"removed_by_category":null,"retrieved_utc":1623021191,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"I saw a video of Facebook having a hand gesture vr keyboard. I was wondering if gestures would be the only way it would work or if you could have like an augmented keyboard mapped to your table to “type” on. Would this be possible, I’m not sure how the program would know what key your pressing. I just think it would be cool to be able to have a virtual computer anywhere because I’ve seen demos of being able to map virtual screens to walls so that could be a monitor. Haha imagine how dumb you would look in public. I think it would be cool tho.","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_subscribers":28280,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"AR keyboard?","top_awarded_type":null,"total_awards_received":0,"treatment_tags":[],"upvote_ratio":1.0,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/j8bwdi\/ar_keyboard\/","whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":true,"author":"KarmaInvestor","author_created_utc":1386178044,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_e7aa1","author_patreon_flair":false,"author_premium":false,"awarders":[],"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1568565876,"discussion_type":null,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{},"hidden":false,"id":"d4my58","is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"no_follow":false,"num_comments":30,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/d4my58\/discussion_how_do_we_solve_typing_in_ar\/","pinned":false,"post_hint":"self","preview":{"enabled":false,"images":[{"id":"11KgG4agvzpZG6S-iobFFMUaxMNwkXK44oXQiOMvikU","resolutions":[{"height":81,"url":"https:\/\/external-preview.redd.it\/YpHCQBeU9AVyJqC3D7gkgXZkXQSBOkMVOQP6sXTNjyA.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=e871260767d87a35b82a852f3e09a0d0f2ac5942","width":108},{"height":162,"url":"https:\/\/external-preview.redd.it\/YpHCQBeU9AVyJqC3D7gkgXZkXQSBOkMVOQP6sXTNjyA.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=38dca09d10a85cdaa18a3dd1608a3383a6c638d0","width":216},{"height":240,"url":"https:\/\/external-preview.redd.it\/YpHCQBeU9AVyJqC3D7gkgXZkXQSBOkMVOQP6sXTNjyA.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=53e9dc2849378307bdd11a2962a99398d516ce7d","width":320}],"source":{"height":360,"url":"https:\/\/external-preview.redd.it\/YpHCQBeU9AVyJqC3D7gkgXZkXQSBOkMVOQP6sXTNjyA.jpg?auto=webp&amp;s=d77fc6947a172d2deaaa3815b80cf1eef4db1bb4","width":480},"variants":{}}]},"pwls":6,"quarantine":false,"removal_reason":null,"removed_by":null,"removed_by_category":null,"retrieved_on":1586079598,"score":19,"secure_media":null,"secure_media_embed":{},"selftext":"Picture yourself 5 years from now. We finally have a product on the market that you can (and want to) wear basically all day round. The output from the glasses makes the smartphone an inferior way of retrieving and processing data, and for some, there's not even a need for a laptop (I'm talking about people that are satisfied with an iPad right now).\n\nBut, we also need a superior way to input data. There are quite a few ways we can tackle this in my opinion:\n\n&amp;#x200B;\n\n1. **Virtual keyboard where your hands are recognized by the AR-device.**\n\n**Pros:**\n\n* Easy to learn.\n\n**Cons:**\n\n* Hands must be seen by the device, but also by the person, which means that you will need to bring your hands in front of your face to see where you place them. This will not be ergonomic, and it will also look too weird to be adopted by the masses (kind of like how most people aren't comfortable with speech-to-text in public).\n* You will probably never be as fast as typing on a physical keyboard (no haptic feedback)\n\n**2.  A device attached to hand\/fingers that registers input by different gestures.** ([Example](https:\/\/www.youtube.com\/watch?v=8za_4g5zCOM))\n\n**Pros:**\n\n* No need to see your own hands. You typing can be discreet and ergonomic.\n* Possibility for haptic feedback (vibrations)\n* Being able to type really fast. Typing will boil down to your muscle-memory.\n\n**Cons:**\n\n* You need a device on your hands. Even if it's only a ring on one of your fingers, it's still a ring. This ring also needs to be charged.\n* Very steep learning curve. Your keyboard typing skills will not translate at all.\n\n**3. Voice control**\n\n* Yeah... no. Too obstructive and weird to be widely adopted. Also kind of slow.\n\n**4. Brain-machine-interface** (Example: Neuralinks keyboard typing feature)\n\n**Pros:**\n\n* The best way\n\n**Cons:**\n\n* Not feasible in the present or near future.\n\n&amp;#x200B;\n\n**5. Sensors in the headset registring movements of muscles in the head** (Example: Picking up teeth-clicking, jaw movements, and tongue movements. Stephen Hawking is an example of this technology, and he could only move one or two muscles. Healthy individuals might be able to use 10+ muscle movements)\n\n**Pros:**\n\n* Very discreet\n* Machine learning might speed up learning (basically, everyone has their own way of typing different characters, depending on what feels right)\n* No extra device\n* Hands are totally free\n* Possibility to become really fast\n\n**Cons:**\n\n* This technology hasn't been explored, Stephen Hawking is a proof of concept at best.\n* The learning curve might be very steep\n* Sensors will take up space in headset\/glasses.\n* Muscle strain.\n\n**6. Eye-tracking** (Example: Virtual keyboard that registers a key when you look at it, combine with word-guessing and auto-correct)\n\n**Pros:**\n\n* Eye-tracking technology is already pretty good\n* Discreet\n* Hands-free\n* No muscle moves as fast as your eyes do, so typing may be very fast.\n* Intuitive and basically no learning curve if you are familiar with a keyboard.\n* Possible to apply machine learning to guess the word based on eye movements.\n\n**Cons:**\n\n* Eyestrain (more precise eye-tracking will facilitate this, as you do not have to move your eyes as much)\n\n&amp;#x200B;\n\n**Summary:**\n\nThese are just a few alternatives that I haven't given much thought about. I really wonder what you guys think about this problem. I see typing as an obstacle that needs to be solved before AR-glasses overthrows the smartphone.\n\nMy personal bet will be on eye-tracking, but I don't think it will be the first widely used way of typing\/input of data.\n\nWhat are your thoughts?\n\nWhich method makes the most sense?\n\nIs there a method that I've missed? Additional pros\/cons?\n\nIs this not as big of a problem that I make it out to be?\n\nHave a great day!","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":20134,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"[Discussion] How do we solve typing in AR?","total_awards_received":0,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/d4my58\/discussion_how_do_we_solve_typing_in_ar\/","whitelist_status":"all_ads","wls":6},{"all_awardings":[],"allow_live_comments":false,"archived":false,"author":"t0ns0fph0t0ns","author_created_utc":1545589798,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_2ug58v8m","author_patreon_flair":false,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1561528520,"crosspost_parent":"t3_c5m1v2","crosspost_parent_list":[{"all_awardings":[],"allow_live_comments":false,"approved_at_utc":null,"approved_by":null,"archived":false,"author":"t0ns0fph0t0ns","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_2ug58v8m","author_patreon_flair":false,"banned_at_utc":null,"banned_by":null,"can_gild":true,"can_mod_post":false,"category":null,"clicked":false,"collections":[{"author_id":"t2_2ne68rq8","author_name":"LegendOfHiddnTempl","collection_id":"b7204d6b-4843-486f-ac72-45fd03bfedc6","created_at_utc":1556100088.701,"description":"","display_layout":null,"last_update_utc":1566746256.441,"link_ids":["t3_bdv51g","t3_bdw9fe","t3_b7lv75","t3_b676uj","t3_b3zw8h","t3_b2zejw","t3_b2xc4c","t3_adudq6","t3_ac3fgk","t3_acwhak","t3_adr1qp","t3_advip5","t3_aduidy","t3_adhvjv","t3_aemlh8","t3_aez84l","t3_aftrmp","t3_agfp9c","t3_agoci7","t3_ahe0lc","t3_ai9eny","t3_ajnrc8","t3_ajrtup","t3_al0qj3","t3_anqifv","t3_ao5w5z","t3_ap5n2c","t3_at3vgk","t3_asbebv","t3_as9ote","t3_arx58e","t3_aqpxzs","t3_aqjshu","t3_aub0o0","t3_aucat0","t3_auay57","t3_aulqm4","t3_aupmqb","t3_avnpcv","t3_avppvf","t3_axj4nf","t3_ayfxtk","t3_axry0t","t3_ayoo7f","t3_ayrgs5","t3_azw7he","t3_b25u4c","t3_bi89q8","t3_bifce1","t3_bifkhg","t3_bk13if","t3_bkirgg","t3_addr61","t3_bl8cm0","t3_bm3k6d","t3_bmg0vm","t3_bouovf","t3_bpxuf9","t3_br04rj","t3_bsl6rc","t3_buqbet","t3_bur9r0","t3_burbfi","t3_buuj6s","t3_bo63rb","t3_b65ubu","t3_buvgd2","t3_bv3y4u","t3_bv4io1","t3_bwrfw4","t3_bzpac0","t3_c18kr5","t3_c35c1t","t3_c5bjmn","t3_c5m1v2","t3_c5mb9l","t3_c6rm4w","t3_caisxx","t3_cax06f","t3_cb1d2h","t3_cccet9","t3_cfg1kr","t3_chtirg","t3_ciehmp","t3_cji3ay","t3_cjlgkh","t3_ck5zqr","t3_cll394","t3_cn3csu","t3_cjomno","t3_cpbs59","t3_cr5ie1","t3_cr7la1","t3_cs0zph","t3_ctd39z","t3_ctf670","t3_cukzeu","t3_cv9qd1"],"permalink":"https:\/\/www.reddit.com\/r\/AR_MR_XR\/collection\/b7204d6b-4843-486f-ac72-45fd03bfedc6","subreddit_id":"t5_t9z3q","title":"Immersive Display Products"}],"content_categories":null,"contest_mode":false,"created":1561557248.0,"created_utc":1561528448.0,"discussion_type":null,"distinguished":null,"domain":"digit.in","downs":0,"edited":false,"gilded":0,"gildings":{},"hidden":false,"hide_score":false,"id":"c5m1v2","is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":false,"is_video":false,"likes":null,"link_flair_background_color":"#d8d8d8","link_flair_css_class":"","link_flair_richtext":[],"link_flair_template_id":"4155495a-06cf-11e9-924a-0ee78303bd0a","link_flair_text":"Hardware","link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_note":null,"mod_reason_by":null,"mod_reason_title":null,"mod_reports":[],"name":"t3_c5m1v2","no_follow":true,"num_comments":1,"num_crossposts":1,"num_reports":null,"over_18":false,"parent_whitelist_status":null,"permalink":"\/r\/AR_MR_XR\/comments\/c5m1v2\/vivo_ar_glasses_prototype_revealed_720p_jovi\/","pinned":false,"post_hint":"link","preview":{"enabled":false,"images":[{"id":"WXHyFiqlTCCH9sLZMqUWiTuPJdNnSGvCCE-dNdPBesQ","resolutions":[{"height":108,"url":"https:\/\/external-preview.redd.it\/6AbVszNiLgosF55f7akVP4kk9U4raMyDks1RrokjFe0.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=cf9de8152c5f89564a202abc09ef869665f25ddb","width":108},{"height":216,"url":"https:\/\/external-preview.redd.it\/6AbVszNiLgosF55f7akVP4kk9U4raMyDks1RrokjFe0.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=bd98f4b4addfa21e0785bca87267c7a4a5376a53","width":216},{"height":320,"url":"https:\/\/external-preview.redd.it\/6AbVszNiLgosF55f7akVP4kk9U4raMyDks1RrokjFe0.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=04540d219d664cf6d303bb7efaf8350819d06cd4","width":320}],"source":{"height":480,"url":"https:\/\/external-preview.redd.it\/6AbVszNiLgosF55f7akVP4kk9U4raMyDks1RrokjFe0.jpg?auto=webp&amp;s=812c781be4122d72a11c436bff31c992e9cfc3d3","width":480},"variants":{}}]},"pwls":null,"quarantine":false,"removal_reason":null,"report_reasons":null,"saved":false,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"","selftext_html":null,"send_replies":true,"spoiler":false,"stickied":false,"subreddit":"AR_MR_XR","subreddit_id":"t5_t9z3q","subreddit_name_prefixed":"r\/AR_MR_XR","subreddit_subscribers":743,"subreddit_type":"restricted","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/xPr5oajiDMYB-6thTOHtuVYC2klmsmBnjojesa7X1ww.jpg","thumbnail_height":140,"thumbnail_width":140,"title":"Vivo AR Glasses Prototype revealed | 720p, Jovi digital assistant, Eye-Tracking, Object and Facial Recognition, connected to 5G Smartphone which acts as Controller \/ Keyboard","total_awards_received":0,"ups":1,"url":"https:\/\/www.digit.in\/news\/vr-ar\/vivo-ar-glasses-with-jovi-digital-assistant-announced-at-mwc-shanghai-48788.html","user_reports":[],"view_count":null,"visited":false,"whitelist_status":null,"wls":null}],"discussion_type":null,"distinguished":null,"domain":"digit.in","edited":false,"gilded":0,"gildings":{},"hidden":false,"id":"c5m2bk","is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":false,"is_video":false,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"no_follow":false,"num_comments":1,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/c5m2bk\/vivo_ar_glasses_prototype_revealed_720p_jovi\/","pinned":false,"post_hint":"link","preview":{"enabled":false,"images":[{"id":"WXHyFiqlTCCH9sLZMqUWiTuPJdNnSGvCCE-dNdPBesQ","resolutions":[{"height":108,"url":"https:\/\/external-preview.redd.it\/6AbVszNiLgosF55f7akVP4kk9U4raMyDks1RrokjFe0.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=cf9de8152c5f89564a202abc09ef869665f25ddb","width":108},{"height":216,"url":"https:\/\/external-preview.redd.it\/6AbVszNiLgosF55f7akVP4kk9U4raMyDks1RrokjFe0.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=bd98f4b4addfa21e0785bca87267c7a4a5376a53","width":216},{"height":320,"url":"https:\/\/external-preview.redd.it\/6AbVszNiLgosF55f7akVP4kk9U4raMyDks1RrokjFe0.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=04540d219d664cf6d303bb7efaf8350819d06cd4","width":320}],"source":{"height":480,"url":"https:\/\/external-preview.redd.it\/6AbVszNiLgosF55f7akVP4kk9U4raMyDks1RrokjFe0.jpg?auto=webp&amp;s=812c781be4122d72a11c436bff31c992e9cfc3d3","width":480},"variants":{}}]},"pwls":6,"quarantine":false,"removal_reason":null,"retrieved_on":1566760079,"score":4,"secure_media":null,"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":16701,"subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/xPr5oajiDMYB-6thTOHtuVYC2klmsmBnjojesa7X1ww.jpg","thumbnail_height":140,"thumbnail_width":140,"title":"Vivo AR Glasses Prototype revealed | 720p, Jovi digital assistant, Eye-Tracking, Object and Facial Recognition, connected to 5G Smartphone which acts as Controller \/ Keyboard","total_awards_received":0,"url":"https:\/\/www.digit.in\/news\/vr-ar\/vivo-ar-glasses-with-jovi-digital-assistant-announced-at-mwc-shanghai-48788.html","whitelist_status":"all_ads","wls":6},{"archived":false,"author":"TheKing01","author_created_utc":1408805892,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_i0iy4","author_patreon_flair":false,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1551233715,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{"gid_1":0,"gid_2":0,"gid_3":0},"hidden":false,"id":"av7u6p","is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"no_follow":true,"num_comments":7,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/av7u6p\/idea_ar_desktop_environment\/","pinned":false,"post_hint":"self","preview":{"enabled":false,"images":[{"id":"WJF6DGtoxbarbo_hS_1qfqvJL3vdzLEFn5TthPGw5Hg","resolutions":[{"height":80,"url":"https:\/\/external-preview.redd.it\/9DEXK4zHN2YRq6WAj__wQM1o-uQG_7hNCZZ5Zt9ARTE.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=9f60c0dfb26fc7729965ba8e3313625bccc968ac","width":108},{"height":161,"url":"https:\/\/external-preview.redd.it\/9DEXK4zHN2YRq6WAj__wQM1o-uQG_7hNCZZ5Zt9ARTE.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=94927b24c2805c4ee8e8284c84ea717309d100d5","width":216},{"height":238,"url":"https:\/\/external-preview.redd.it\/9DEXK4zHN2YRq6WAj__wQM1o-uQG_7hNCZZ5Zt9ARTE.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=c4a060f430fae8c805bbdc28fa3a72e04adafcec","width":320}],"source":{"height":261,"url":"https:\/\/external-preview.redd.it\/9DEXK4zHN2YRq6WAj__wQM1o-uQG_7hNCZZ5Zt9ARTE.jpg?auto=webp&amp;s=7371e750b1b81c3226b8ae76fac3111cd97140b6","width":350},"variants":{}}]},"pwls":6,"quarantine":false,"removal_reason":null,"retrieved_on":1553269989,"score":3,"secure_media":null,"secure_media_embed":{},"selftext":"So I had an idea for a different way of interfacing with programs, with AR. The idea is that instead of a single monitor, a user would have a bunch of rectangular pieces of plastic covered in AR markers, called \"frames\". The contents of the program windows would then be projected onto these frames. This would allow the user to organize the window arrangement using their hands in real space, instead of using a mouse in monitor space. Additionally, by default, sound produced by a program sounds like it is coming from the frame it's window is in. However, this setting could be overridden. For example, while watching a video or listening to music, they may want a surround sound type system. For notification sounds and such however, however the sound sound like it is coming from the frame would be more intuitive.\n\nTo actually interact with the programs, there would be a standard keyboard, as well as a stylus. The stylus is just another piece of plastic, again covered in AR markers. However, nothing need be projected onto the stylus (although the AR markers could be covered, or a design put on it, if wanted). Rather, the AR markers are just used to determine where the stylus is in real space. The computer can then calculate if the stylus is touching a frame, and where. This would correspond to touch events in the software (like would happen with a touchscreen). You could also put a pressure and angle sensor at the tip of the stylus to increase accuracy and provide pressure information (which can be used by certain graphics programs, such as gimp). However, you would probably need the make the AR system have a wide angle camera, in case the user interacts with a frame without looking at it. You'd probably also want some sort of feedback so the user can know if a touch event failed.\n\nIn addition to the large frames for full applications, you would also have smaller frames for icons, widgets, and other important desktop features. You could physically arrange these along your desktop as wanted. You could also have some frames that can stand up, so the user does not need to hold it. For example, there could be a frame especially designed to hold a clock widget that can stand up at an angle.\n\nAs an example of what using this would be like, envision this. An artist is holding a frame running a graphics program. Their desk has a bunch of frames containing images of their subject, as well as a widget with the time, and a little newton's cradle for atmosphere. They also have frames for the tool windows of the graphics program, which they use like an artist palette. Using this set up, they draw their subject, being able to rotate their head to look at different images, the canvas, and the tool windows.\n\nOr you can imagine a coder, with a large window for their text editor, which they navigate mostly using keyboard shortcuts (like in Vi or Emacs). Additionally, they have tool windows, documentation, and tutorials scattered all across their desk. They are also running Xpenguins, of course.\n\nWhat do you all think of this idea?\n\nP.S. You might be thinking \"wouldn't it be a huge hassle to port all the programs to this system\"? It would be, but luckily this is not required. Rather, all you have to do is write a [desktop environment](https:\/\/en.wikipedia.org\/wiki\/Desktop_environment) that implements the above idea. Programs and the operating system interact with the operating system in an abstract way, so they do not care if they are in windows on a monitor, tiles in a tiling window manager, or plastic frames on your physical desk. Xpenguins would probably have to be ported, though.","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":13510,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Idea: AR desktop environment","url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/av7u6p\/idea_ar_desktop_environment\/","whitelist_status":"all_ads","wls":6},{"archived":false,"author":"jongeheer","author_created_utc":1392119262,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_f81l6","author_patreon_flair":false,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1538219009,"distinguished":null,"domain":"v.redd.it","edited":false,"gilded":0,"gildings":{"gid_1":0,"gid_2":0,"gid_3":0},"hidden":false,"id":"9jvpea","is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":true,"is_robot_indexable":true,"is_self":false,"is_video":true,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_template_id":null,"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":{"reddit_video":{"dash_url":"https:\/\/v.redd.it\/fwi5chz1t5p11\/DASHPlaylist.mpd","duration":18,"fallback_url":"https:\/\/v.redd.it\/fwi5chz1t5p11\/DASH_9_6_M","height":1080,"hls_url":"https:\/\/v.redd.it\/fwi5chz1t5p11\/HLSPlaylist.m3u8","is_gif":false,"scrubber_media_url":"https:\/\/v.redd.it\/fwi5chz1t5p11\/DASH_600_K","transcoding_status":"completed","width":498}},"media_embed":{},"media_only":false,"no_follow":false,"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/9jvpea\/the_camera_is_the_keyboard\/","pinned":false,"post_hint":"hosted:video","preview":{"enabled":false,"images":[{"id":"XJ8AE1B2InBuLyDKFyx1VUTmSFpX-Sb4JmIMlDaGtgY","resolutions":[{"height":216,"url":"https:\/\/external-preview.redd.it\/lSsQLvBsVjk4IxZZbbG1PTJYW9SMMKHUDFoNIOYck78.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=db77badc9ae6f382dc738127cf138d7162827c9b","width":108},{"height":432,"url":"https:\/\/external-preview.redd.it\/lSsQLvBsVjk4IxZZbbG1PTJYW9SMMKHUDFoNIOYck78.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=7fd47d2d83d249cae21e94cf28b262b837f5c065","width":216},{"height":640,"url":"https:\/\/external-preview.redd.it\/lSsQLvBsVjk4IxZZbbG1PTJYW9SMMKHUDFoNIOYck78.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=827ac55b9e43bffc83aa86fcc56813c8c80d1bb4","width":320},{"height":1280,"url":"https:\/\/external-preview.redd.it\/lSsQLvBsVjk4IxZZbbG1PTJYW9SMMKHUDFoNIOYck78.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=396b16359bd09839799e5f79b3ddb2e910725526","width":640}],"source":{"height":1920,"url":"https:\/\/external-preview.redd.it\/lSsQLvBsVjk4IxZZbbG1PTJYW9SMMKHUDFoNIOYck78.png?auto=webp&amp;s=3a11171cf50c2e50837e58115d5575011d13dd66","width":886},"variants":{}}]},"pwls":6,"quarantine":false,"removal_reason":null,"retrieved_on":1540191289,"score":2,"secure_media":{"reddit_video":{"dash_url":"https:\/\/v.redd.it\/fwi5chz1t5p11\/DASHPlaylist.mpd","duration":18,"fallback_url":"https:\/\/v.redd.it\/fwi5chz1t5p11\/DASH_9_6_M","height":1080,"hls_url":"https:\/\/v.redd.it\/fwi5chz1t5p11\/HLSPlaylist.m3u8","is_gif":false,"scrubber_media_url":"https:\/\/v.redd.it\/fwi5chz1t5p11\/DASH_600_K","transcoding_status":"completed","width":498}},"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":11262,"subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/a.thumbs.redditmedia.com\/wQOdtkFTYoMortSse5eREfGkEqZWx0hOkFdyqelciT4.jpg","thumbnail_height":140,"thumbnail_width":140,"title":"The camera is the keyboard.","url":"https:\/\/v.redd.it\/fwi5chz1t5p11","whitelist_status":"all_ads","wls":6},{"archived":false,"author":"Impacatus","author_created_utc":1401809955,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_gtwut","author_patreon_flair":false,"can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1538111273,"distinguished":null,"domain":"self.augmentedreality","edited":false,"gilded":0,"gildings":{"gid_1":0,"gid_2":0,"gid_3":0},"hidden":false,"id":"9jk5v4","is_crosspostable":true,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_robot_indexable":true,"is_self":true,"is_video":false,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_template_id":null,"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"no_follow":true,"num_comments":3,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/9jk5v4\/would_any_currently_or_soontobe_available_ar_make\/","pinned":false,"pwls":6,"quarantine":false,"removal_reason":null,"retrieved_on":1540185901,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"I'm a programmer, and like many programmers, I have my eccentricities.  One of them is when writing code at home, I like to lie in a hammock.  Up until now, I've relied on laptops to do this, but they have some shortcomings, especially the lack of modularity.  Wouldn't it be great, I thought, if I could buy the keyboard, computer, and display separately and customize them to my needs?  Invest in a really nice mechanical keyboard and grow accustomed to it like a Shadowrun decker to his deck?\n\nThe display has always been the fly in that ointment.  It won't stay upright if it's not part of a laptop, and if it is it will be completely awkward to use it and another keyboard at the same time.  Could an AR device be the answer to that problem?  One that I could control using a bluetooth keyboard, interfacing with another computer as needed?\n\nAt the minimum, I need something that can ssh into another machine.  That would let me do most of what I need to do.  What would be nice to have is something that can remote desktop into another machine, so I can use it to control the computer that runs the tv too.\n\nIs AR technology at the point where any of this is possible yet?  If so, which device would you recommend?","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":11258,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Would any currently or soon-to-be available AR make for a tolerable code-writing experience?","url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/9jk5v4\/would_any_currently_or_soontobe_available_ar_make\/","whitelist_status":"all_ads","wls":6},{"archived":false,"author":"thisissamsaxton","author_created_utc":1284947149,"author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","author_fullname":"t2_4cwrb","can_gild":true,"can_mod_post":false,"category":null,"content_categories":null,"contest_mode":false,"created_utc":1528292014,"distinguished":null,"domain":"imgur.com","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"8p0n4d","is_crosspostable":false,"is_meta":false,"is_original_content":false,"is_reddit_media_domain":false,"is_self":false,"is_video":false,"link_flair_background_color":"","link_flair_css_class":null,"link_flair_richtext":[],"link_flair_template_id":null,"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"no_follow":true,"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/8p0n4d\/the_keyboard_of_the_future_part_2\/","pinned":false,"pwls":6,"quarantine":false,"removal_reason":null,"retrieved_on":1536341570,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_subscribers":10565,"subreddit_type":"public","suggested_sort":null,"thumbnail":"default","thumbnail_height":106,"thumbnail_width":140,"title":"\"The Keyboard of the Future\" Part 2","url":"https:\/\/imgur.com\/gallery\/stZp5yJ","whitelist_status":"all_ads","wls":6},{"approved_by":null,"archived":false,"author":"[deleted]","author_flair_background_color":"","author_flair_css_class":null,"author_flair_template_id":null,"author_flair_text":null,"author_flair_text_color":"dark","banned_by":null,"can_gild":false,"category":null,"clicked":false,"content_categories":null,"contest_mode":false,"created":1522861218.0,"created_utc":1522832418,"distinguished":null,"domain":"self.augmentedreality","downs":0,"edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"89ntwv","is_crosspostable":false,"is_original_content":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"likes":null,"link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"media_only":false,"mod_reports":[],"name":"t3_89ntwv","no_follow":true,"num_comments":1,"num_crossposts":0,"num_reports":null,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/89ntwv\/how_teaching_methods_evolved_in_a_course_of_time\/","pinned":false,"post_categories":null,"pwls":6,"removal_reason":null,"report_reasons":null,"retrieved_on":1529546167,"rte_mode":"markdown","saved":false,"score":2,"secure_media":null,"secure_media_embed":{},"selftext":"Early literacy education is important for children as it establishes the foundation of reading and writing skills which is essential for future education. \n\nFurthermore, it can help in development of children’s emotion, thinking, and language. Literature program in pre-school is mainly the positive attitude towards literature. \n\nMoreover, the old folk stories tend to disappear among children of the newer generation (traditional storytelling).\n\nTraditional storytelling uses physical books which allow many interactions and sensory feedbacks between reader and the book such as speech through the narration, vision through pictures and touching through the turning and pointing at the pages. \n\nHowever, reading book can be a monotonous activity as actions are usually descriptive based and illustrated through static graphics. The e-books that were introduced later provided various types of media supported and lively characters through animation.\n\nThis grabbed the user’s attention but the user’s interaction was limited to the use of mouse and keyboard to control the book.\n \nMost young students disengage from the educational process because it is often outdated, lacks stimulation, and does not incorporate technology. Reliance on modern processes can lead to a more engaging and structured environment where students are able to interact on an intellectual and a social level.\n\nAR technology has helped to remove the above-mentioned barriers. The unique features of AR could be used to enhance a physical storybook by augmenting the book pages with the graphics, animation, and audio. Integrating AR concept into a physical book will convert a boring story reading experience into an interactive, fun and interesting reading experience for the pre-schoolers. \n \nVery young children can develop visual, spatial, mathematical, social, emotional, and creative abilities faster with the correct stimulation. Augmented Reality includes 3D imaging and artwork with bright colors and animation that maximizes stimulation and intellectual responsiveness in kindergarten learners. This engages young minds and provides a fun educational environment. \nWith exciting features provided on a computer-based platform, learners are excited about the subject and are more likely to engage in the different educational processes. It can ease the teaching process and assists students with higher level academics at a later stage.\n\nHence, the interactive learning environment can turn passive learners into active learners that are fully engaged.","selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Early literacy education is important for children as it establishes the foundation of reading and writing skills which is essential for future education. &lt;\/p&gt;\n\n&lt;p&gt;Furthermore, it can help in development of children’s emotion, thinking, and language. Literature program in pre-school is mainly the positive attitude towards literature. &lt;\/p&gt;\n\n&lt;p&gt;Moreover, the old folk stories tend to disappear among children of the newer generation (traditional storytelling).&lt;\/p&gt;\n\n&lt;p&gt;Traditional storytelling uses physical books which allow many interactions and sensory feedbacks between reader and the book such as speech through the narration, vision through pictures and touching through the turning and pointing at the pages. &lt;\/p&gt;\n\n&lt;p&gt;However, reading book can be a monotonous activity as actions are usually descriptive based and illustrated through static graphics. The e-books that were introduced later provided various types of media supported and lively characters through animation.&lt;\/p&gt;\n\n&lt;p&gt;This grabbed the user’s attention but the user’s interaction was limited to the use of mouse and keyboard to control the book.&lt;\/p&gt;\n\n&lt;p&gt;Most young students disengage from the educational process because it is often outdated, lacks stimulation, and does not incorporate technology. Reliance on modern processes can lead to a more engaging and structured environment where students are able to interact on an intellectual and a social level.&lt;\/p&gt;\n\n&lt;p&gt;AR technology has helped to remove the above-mentioned barriers. The unique features of AR could be used to enhance a physical storybook by augmenting the book pages with the graphics, animation, and audio. Integrating AR concept into a physical book will convert a boring story reading experience into an interactive, fun and interesting reading experience for the pre-schoolers. &lt;\/p&gt;\n\n&lt;p&gt;Very young children can develop visual, spatial, mathematical, social, emotional, and creative abilities faster with the correct stimulation. Augmented Reality includes 3D imaging and artwork with bright colors and animation that maximizes stimulation and intellectual responsiveness in kindergarten learners. This engages young minds and provides a fun educational environment. \nWith exciting features provided on a computer-based platform, learners are excited about the subject and are more likely to engage in the different educational processes. It can ease the teaching process and assists students with higher level academics at a later stage.&lt;\/p&gt;\n\n&lt;p&gt;Hence, the interactive learning environment can turn passive learners into active learners that are fully engaged.&lt;\/p&gt;\n&lt;\/div&gt;&lt;!-- SC_ON --&gt;","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_subscribers":9447,"subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"How teaching methods evolved in a course of time?","ups":2,"url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/89ntwv\/how_teaching_methods_evolved_in_a_course_of_time\/","user_reports":[],"visited":false,"whitelist_status":"all_ads","wls":6},{"archived":false,"author":"origiwriter","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1510241416,"distinguished":null,"domain":"bestvr.tech","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"7bu019","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":false,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":2,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/7bu019\/htc_teaming_up_with_logitech_to_create_a_virtual\/","pinned":false,"post_hint":"link","preview":{"enabled":false,"images":[{"id":"kOUqdNlW7l3Y8RhhmKs31ShlyDmkBz3QgHVRDz2EB5Q","resolutions":[{"height":60,"url":"https:\/\/i.redditmedia.com\/PqvQk6uJ4Ug-iRkjWqYM81aIU_gJwySDJCmqSFxqNTk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=7679ce113dcd311f59f9fe6c1f988ee2","width":108},{"height":121,"url":"https:\/\/i.redditmedia.com\/PqvQk6uJ4Ug-iRkjWqYM81aIU_gJwySDJCmqSFxqNTk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=f34188cc62c1ec9f8e6c0dd411009ecb","width":216},{"height":179,"url":"https:\/\/i.redditmedia.com\/PqvQk6uJ4Ug-iRkjWqYM81aIU_gJwySDJCmqSFxqNTk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=3d3d838dee8ccc3c5b090ac90cd958a6","width":320},{"height":359,"url":"https:\/\/i.redditmedia.com\/PqvQk6uJ4Ug-iRkjWqYM81aIU_gJwySDJCmqSFxqNTk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=0cd698244518cff440e4bcdbc429206e","width":640},{"height":538,"url":"https:\/\/i.redditmedia.com\/PqvQk6uJ4Ug-iRkjWqYM81aIU_gJwySDJCmqSFxqNTk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=13b66b564248fd53778859e5ac7a5826","width":960}],"source":{"height":561,"url":"https:\/\/i.redditmedia.com\/PqvQk6uJ4Ug-iRkjWqYM81aIU_gJwySDJCmqSFxqNTk.jpg?s=31a7565ff0d2603b5a4a84e5a763528d","width":1000},"variants":{}}]},"retrieved_on":1512234643,"score":9,"secure_media":null,"secure_media_embed":{},"selftext":"","spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_type":"public","suggested_sort":null,"thumbnail":"https:\/\/a.thumbs.redditmedia.com\/-NkBs33xSQTAd0oIHzulVIH3vWFPpZUEdl-TJVlGGR8.jpg","thumbnail_height":78,"thumbnail_width":140,"title":"HTC teaming up with Logitech to create a virtual keyboard -","url":"http:\/\/bestvr.tech\/htc-teaming-logitech-create-virtual-keyboard\/","whitelist_status":"all_ads"},{"archived":false,"author":"matteopisani","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1505851745,"distinguished":null,"domain":"thumbfiti.technology","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"715qkp","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":false,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":1,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/715qkp\/the_best_keyboard_for_your_vrar_applications_has\/","pinned":false,"post_hint":"link","preview":{"enabled":false,"images":[{"id":"iIsFEMBIiiYiFYvMmjMnl9TcmUUA5oCnn1d85ToLwr4","resolutions":[{"height":56,"url":"https:\/\/i.redditmedia.com\/B1EvYLQ9CUFcb-1-TuHNReKeBOyU1PwUaowmGogMv6w.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=e10a6ea8ca17f1e5abf246ae4c9f9dd1","width":108},{"height":113,"url":"https:\/\/i.redditmedia.com\/B1EvYLQ9CUFcb-1-TuHNReKeBOyU1PwUaowmGogMv6w.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=0c6c17fe1f0890863ec865b953d6ec24","width":216},{"height":168,"url":"https:\/\/i.redditmedia.com\/B1EvYLQ9CUFcb-1-TuHNReKeBOyU1PwUaowmGogMv6w.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=5ae618009b8197c6a2c36646841de841","width":320},{"height":336,"url":"https:\/\/i.redditmedia.com\/B1EvYLQ9CUFcb-1-TuHNReKeBOyU1PwUaowmGogMv6w.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=70d2496c9347956f50c0276e18687992","width":640},{"height":504,"url":"https:\/\/i.redditmedia.com\/B1EvYLQ9CUFcb-1-TuHNReKeBOyU1PwUaowmGogMv6w.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=08e5a7a02056f0670f598ce3f7aef8d3","width":960},{"height":567,"url":"https:\/\/i.redditmedia.com\/B1EvYLQ9CUFcb-1-TuHNReKeBOyU1PwUaowmGogMv6w.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=d182607f27d52393ac7dbe4bd7e84c1a","width":1080}],"source":{"height":630,"url":"https:\/\/i.redditmedia.com\/B1EvYLQ9CUFcb-1-TuHNReKeBOyU1PwUaowmGogMv6w.jpg?s=40269aa0a64eac2295cca28b0724f388","width":1200},"variants":{}}]},"retrieved_on":1507576450,"score":0,"secure_media":null,"secure_media_embed":{},"selftext":"","spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","suggested_sort":null,"thumbnail":"https:\/\/b.thumbs.redditmedia.com\/gZX9tQH6cgR6YIUGLhn-QUuzMUZHIwJfp0QxYJl9z4o.jpg","thumbnail_height":73,"thumbnail_width":140,"title":"The best keyboard for your VR\/AR applications has no keys.","url":"http:\/\/thumbfiti.technology\/","whitelist_status":"all_ads"},{"locked":false,"from_id":null,"secure_media_embed":{"scrolling":false,"width":600,"content":"&lt;iframe width=\"600\" height=\"338\" src=\"https:\/\/www.youtube.com\/embed\/e0j_gvKu-EE?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;\/iframe&gt;","height":338},"thumbnail":"http:\/\/a.thumbs.redditmedia.com\/2dsEgy8y5pEum9Bu4vvnUXaNXT_mHI4kW1ZRDf98Oe4.jpg","ups":14,"retrieved_on":1472795426,"author_flair_css_class":null,"name":"t3_4p0ezt","gilded":0,"domain":"youtube.com","title":"Should I continue? AR mech game. Mechs battling on my Mac keyboard. (Under development)","from":null,"saved":false,"link_flair_text":null,"score":14,"author_flair_text":null,"secure_media":{"type":"youtube.com","oembed":{"thumbnail_width":480,"version":"1.0","provider_name":"YouTube","type":"video","thumbnail_height":360,"width":600,"author_url":"https:\/\/www.youtube.com\/channel\/UCPMaAWCOuJ0HcR2sVYErspA","provider_url":"https:\/\/www.youtube.com\/","height":338,"title":"Mech AR","thumbnail_url":"https:\/\/i.ytimg.com\/vi\/e0j_gvKu-EE\/hqdefault.jpg","html":"&lt;iframe width=\"600\" height=\"338\" src=\"https:\/\/www.youtube.com\/embed\/e0j_gvKu-EE?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;\/iframe&gt;","author_name":"Paden Pierry"}},"media":{"type":"youtube.com","oembed":{"height":338,"title":"Mech AR","html":"&lt;iframe width=\"600\" height=\"338\" src=\"https:\/\/www.youtube.com\/embed\/e0j_gvKu-EE?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;\/iframe&gt;","author_name":"Paden Pierry","thumbnail_url":"https:\/\/i.ytimg.com\/vi\/e0j_gvKu-EE\/hqdefault.jpg","width":600,"author_url":"https:\/\/www.youtube.com\/channel\/UCPMaAWCOuJ0HcR2sVYErspA","provider_url":"https:\/\/www.youtube.com\/","provider_name":"YouTube","type":"video","thumbnail_height":360,"thumbnail_width":480,"version":"1.0"}},"url":"https:\/\/www.youtube.com\/watch?v=e0j_gvKu-EE&amp;feature=youtu.be","selftext":"","archived":false,"author":"PadenPierry","media_embed":{"scrolling":false,"width":600,"content":"&lt;iframe width=\"600\" height=\"338\" src=\"https:\/\/www.youtube.com\/embed\/e0j_gvKu-EE?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;\/iframe&gt;","height":338},"num_comments":17,"distinguished":null,"post_hint":"rich:video","quarantine":false,"preview":{"images":[{"resolutions":[{"url":"https:\/\/i.redditmedia.com\/vCl3qN4j7RZR4M2nrAPFKbgd8DcL33R22YRUXiLKX3g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=909417f817d4f6d108612e07db468b9d","width":108,"height":81},{"width":216,"url":"https:\/\/i.redditmedia.com\/vCl3qN4j7RZR4M2nrAPFKbgd8DcL33R22YRUXiLKX3g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=a300fade101972b51210a09edb6719c3","height":162},{"height":240,"url":"https:\/\/i.redditmedia.com\/vCl3qN4j7RZR4M2nrAPFKbgd8DcL33R22YRUXiLKX3g.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=91f6fb36da6b35a3a54f35dcf440cf4f","width":320}],"variants":{},"source":{"url":"https:\/\/i.redditmedia.com\/vCl3qN4j7RZR4M2nrAPFKbgd8DcL33R22YRUXiLKX3g.jpg?s=8087fbd8ba6eecf5452536b115aeda48","width":480,"height":360},"id":"26DXGUxGE5JVi_lYK0MyCG5nRfHKybYq8vzcGcJ7Z7E"}]},"over_18":false,"link_flair_css_class":null,"permalink":"\/r\/augmentedreality\/comments\/4p0ezt\/should_i_continue_ar_mech_game_mechs_battling_on\/","id":"4p0ezt","subreddit_id":"t5_2r2jj","is_self":false,"from_kind":null,"subreddit":"augmentedreality","created_utc":1466449806,"edited":false,"stickied":false,"downs":0,"hide_score":false},{"subreddit":"augmentedreality","saved":false,"media":null,"over_18":false,"author_flair_css_class":null,"is_self":false,"thumbnail":"http:\/\/a.thumbs.redditmedia.com\/5EmZ8yytSIFmT82bpurTt_K7TUlkTYTNJuIIVdCDJO8.jpg","from_kind":null,"hide_score":false,"preview":{"images":[{"source":{"url":"https:\/\/i.redditmedia.com\/spnjCkBy-V06rMOSjiENAc4MVwF8irqagsEobIxEUyQ.jpg?s=2208ae7ff5b5dd0a7066e31238d696db","height":5512,"width":6614},"id":"Srj9mwx9bxphS1qhNRYf39k-2Rnx1eNsyzV5AM7xIOU","variants":{},"resolutions":[{"url":"https:\/\/i.redditmedia.com\/spnjCkBy-V06rMOSjiENAc4MVwF8irqagsEobIxEUyQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=a1761f730e4b956b6de5a997bb2a040c","height":90,"width":108},{"url":"https:\/\/i.redditmedia.com\/spnjCkBy-V06rMOSjiENAc4MVwF8irqagsEobIxEUyQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=3bd40fea4ea46149a9b991d60b178dc8","height":180,"width":216},{"width":320,"height":266,"url":"https:\/\/i.redditmedia.com\/spnjCkBy-V06rMOSjiENAc4MVwF8irqagsEobIxEUyQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=6774fa3291131fba9bc4ecc072677838"},{"url":"https:\/\/i.redditmedia.com\/spnjCkBy-V06rMOSjiENAc4MVwF8irqagsEobIxEUyQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=5c38e5f83ff3d1696d9de10253c3fe96","height":533,"width":640},{"width":960,"height":800,"url":"https:\/\/i.redditmedia.com\/spnjCkBy-V06rMOSjiENAc4MVwF8irqagsEobIxEUyQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=d2f1a81793563e7d383b55b6fa9b930e"},{"height":900,"url":"https:\/\/i.redditmedia.com\/spnjCkBy-V06rMOSjiENAc4MVwF8irqagsEobIxEUyQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=1d5c6dfe1f464636903c762d35c01b59","width":1080}]}]},"secure_media":null,"num_comments":0,"id":"4gdjk6","stickied":false,"permalink":"\/r\/augmentedreality\/comments\/4gdjk6\/instead_of_using_display_screens_and_keyboards\/","name":"t3_4gdjk6","selftext":"","from":null,"media_embed":{},"locked":false,"distinguished":null,"created_utc":1461594481,"gilded":0,"ups":3,"domain":"laserfiche.com","author_flair_text":null,"archived":false,"title":"Instead of using display screens and keyboards, augmented reality users could navigate through an array of holographic screens suspended in front of their faces and controlled with the touch of their hands, with virtual keyboards for data entry.","url":"https:\/\/www.laserfiche.com\/simplicity\/why-you-need-to-care-about-augmented-reality\/","from_id":null,"link_flair_text":null,"score":3,"author":"wheeler1432","subreddit_id":"t5_2r2jj","edited":false,"quarantine":false,"link_flair_css_class":null,"secure_media_embed":{},"retrieved_on":1463572751,"downs":0,"post_hint":"link"},{"distinguished":null,"domain":"blogs.wsj.com","secure_media":null,"hide_score":false,"title":"NEC brings augmented-reality keyboard to user’s forearm.","is_self":false,"id":"3s4zon","post_hint":"link","link_flair_text":null,"thumbnail":"http:\/\/b.thumbs.redditmedia.com\/-DMre3CLPELOH8eQ3yGfPtlPP2Z_Web3t0-SNiHnGaY.jpg","downs":0,"num_comments":0,"quarantine":false,"edited":false,"media":null,"preview":{"images":[{"id":"VlQxBpxAklpvn-VGo2u4kzGd0A21swH_WTc2Nu94EJA","variants":{},"source":{"width":749,"height":499,"url":"https:\/\/i.redditmedia.com\/B83kiedQ9H0JYiIOZ7BbxPoa4QUvpFXop3X89UdJMzQ.jpg?s=06c29cfd1acf0bf3f689c7b5a96326f2"},"resolutions":[{"url":"https:\/\/i.redditmedia.com\/B83kiedQ9H0JYiIOZ7BbxPoa4QUvpFXop3X89UdJMzQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=65ddb3ff512e5225ad9573c64009edca","height":71,"width":108},{"width":216,"url":"https:\/\/i.redditmedia.com\/B83kiedQ9H0JYiIOZ7BbxPoa4QUvpFXop3X89UdJMzQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=692a1125352ca67942ae6589527114be","height":143},{"width":320,"height":213,"url":"https:\/\/i.redditmedia.com\/B83kiedQ9H0JYiIOZ7BbxPoa4QUvpFXop3X89UdJMzQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=1387bc930314e207c489ebd1ddd89833"},{"height":426,"url":"https:\/\/i.redditmedia.com\/B83kiedQ9H0JYiIOZ7BbxPoa4QUvpFXop3X89UdJMzQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=66d361b6130d187fdc055ad63eb6d75a","width":640}]}]},"created_utc":"1447080605","created":1447109405,"author_flair_css_class":null,"subreddit":"augmentedreality","media_embed":{},"subreddit_id":"t5_2r2jj","secure_media_embed":{},"name":"t3_3s4zon","from":null,"retrieved_on":1450673696,"locked":false,"gilded":0,"archived":false,"from_id":null,"author_flair_text":null,"selftext":"","from_kind":null,"author":"spsheridan","saved":false,"link_flair_css_class":null,"stickied":false,"score":2,"url":"http:\/\/blogs.wsj.com\/japanrealtime\/2015\/11\/06\/nec-brings-augmented-reality-keyboard-to-users-forearm\/","over_18":false,"permalink":"\/r\/augmentedreality\/comments\/3s4zon\/nec_brings_augmentedreality_keyboard_to_users\/","ups":2},{"archived":true,"author":"agentid36","author_flair_background_color":null,"author_flair_css_class":null,"author_flair_richtext":[],"author_flair_text":null,"author_flair_text_color":null,"author_flair_type":"text","brand_safe":true,"can_gild":true,"contest_mode":false,"created_utc":1271128673,"distinguished":null,"domain":"self.augmentedreality","edited":1271132273.0,"gilded":0,"hidden":false,"hide_score":false,"id":"bq30x","is_crosspostable":true,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_richtext":[],"link_flair_text":null,"link_flair_text_color":"dark","link_flair_type":"text","locked":false,"media":null,"media_embed":{},"no_follow":true,"num_comments":4,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"\/r\/augmentedreality\/comments\/bq30x\/concept_for_ar_widearea_augmented_reality_with\/","retrieved_on":1522909980,"rte_mode":"markdown","score":1,"secure_media":null,"secure_media_embed":{},"selftext":"In advance TL;DR: explaining my concept of effectively 'Second Life' overlaid over real life with the necessary hardware and software + moderately full hand force feedback. (mixed reality)\nWide-Area Augmented Reality with integrated haptics:\n\nMobile 3D graphics have been getting so advanced, this is probably somewhere it could go. The current stuff getting made into AR is all gimmicky, no real substance behind it, even though it is fun and cool. And yeah, the whole portable computing platform idea has been put forward before, but the control methods for all of them suck, just keyboards slapped on a wrist. And none have really been fleshed out as a system, just as limited tech concepts or as failed systems.\n\n\nHere is a low polygon version, close to what the virtual world would be like: \nhttp:\/\/www.tinmith.net\/index.htm\n\nThis is the 'Wide Area' Augmented Reality part. Persistent virtual objects (vobs)(their files), with the associated metadata provided by public servers, private servers (or perhaps by distributed cloud), and by each unit themselves interacting with each other via ad-hoc wi-fi.\n\nThere needs to be some kind of tactile feedback to provide a sufficient sense of realness to this. I don't think that people will find it entirely possible to interact with no physicality. A force feedback glove with the force provided just to the tips of the fingers; pulling them down, up and side to side should (hopefully) be sufficient to provide enough sensation. Not the end, but definitely a beginning.\nWith sufficient hardware and software, any virtual control system can be created. Any object, anything can be simulated for a user.\nAlso, implementing a device similar to the 'epam' (http:\/\/www.artificialmuscle.com\/technology\/epam.php) may be able to provide a decent approximation of texture over distance and time, but at 1:10 here:\nhttp:\/\/www.youtube.com\/watch?v=B22VLye3loE\nthere is a device that can provide fine texture definition that doesn't require vibration.\n\nHere is the only closest thing I could find to a force-feedback glove:\nhttp:\/\/www.cyberglovesystems.com\/products\/hardware\/cybergrasp.php\nThe only problem with this system is it is far too obtrusive (and unattractive) for anyone to want to use, it really needs to be more low-profile and attractive; simple, thin gloves.\nI recently found this, which looks better, but it still needs to be slimmed down:\nhttp:\/\/www.youtube.com\/watch?v=4aJkJKVS_pk\n\nThe cybergrasp has a backpack unit that appears to contain the actuators for the device, but it is definitely too bulky, so it would probably be best to move the actuators to the forearm. Some kind of linear actuator is needed for this, and I have been unable to find any products that are suitable for these requirements (an inchworm motor may work, but I don't know if it is fast enough. http:\/\/en.wikipedia.org\/wiki\/Inchworm_motor \nPerhaps a macro version could work?)\nSolenoids are close, but they do not have the travel distance necessary. Possibly a string of solenoids, or Muscle Wire (http:\/\/elexp.com\/kit_2mt3.htm) could work, but that needs more research.\n\nThe largest hurdle though, is providing the display itself:\nhttp:\/\/www.lumus-optical.com\/\nhttp:\/\/www.microvision.com\/wearable_displays\/mobile.html\nThese are what are needed, but neither of them appear to be products commercially available yet (they don’t appear to even be out of prototype). This is pretty much the one huge hurdle. Their websites make them seem close to reality but I’m highly dubious. Anybody have anything concrete?\n\n\nNecessary Positional Information detection:\nBody position information sensing has been done before, so this is probably the easiest hardware hurdle to get around. Some combination of GPS, accelerometer, joint-angle measurements, and perhaps ubiquitous cameras can provide everything necessary to make this work; the details just need to get ironed out.\n\nHead plane sensing\nA good example of the huge leap forward in perception that can be provided by changing what is seen by tracking your head is demonstrated by Johnny Chung’s WiiMote Head Tracking: http:\/\/johnnylee.net\/projects\/wii\/\nThis would provide information to the UI to place items in the virtual space, so that they can appear to be objects in real space.\nTo provide the necessary information to the Display System, the vector of the face, along with yaw must be provided.\n\nShoulders, waist and geographic location are also needed.\n\n\n\nApplications:\n\nMedical:\nApplication for the blind\n-This could have a decent impact on the blind:\nPlace virtual cushions around real world objects (resistance increases as user gets closer to the object, provided by the gloves), giving them an additional sense (large portions of the world must be mapped out for this, which would be made vastly easier by distributed mapping, explained later). 3d models of objects can be provided by rfid tags built into objects, providing positional and surface information about glassware, any object, without touching it.\nUnfortunately, complete environmental awareness cannot be provided due to cars and other mobile objects, therefore this can only be an additional sense provided to the blind, not a complete replacement for the walking stick.\n-Full hand feedback for surgery practice\n\n-Make 3D movies into a true possibility, the user can even be placed directly into the action\n-Tele-presence, haptic feedback. Put two people miles away into one room.\n-More immersive computer games (ARQuake)\n-Revolutionize 3D design\/CAD\n-Provide control systems to any and all vehicles, giving an unprecedented level of customization for each individual user while reducing production costs for the manufacturer (provided the vehicle\/device is equipped with ad-hoc wi-fi\/bluetooth hooked into the control systems)\n-Full virtual computer keyboard instead of a small cell phone pseudokeyboard or a blackberry keyboard (as compared to current phone AR apps)\n-A more ‘real’ sensation provided by full hand control and feedback than can be provided by current computer peripherals.\n-First person street maps – always know what street you are on, even if you can’t see the physical real world signs, similar to Google Maps Street View\n-Reviews for restaurants directly in front of them (subscription or location based) that can be changed based on personal preferences, or by the owners. (see Layar - http:\/\/layar.eu\/ ) (Google Maps Street View as well)\n-Could make the concept of exchanging files between users MUCH easier to the end user. (provided the underlying structure is there, and even more so if the files are not stored locally, but on the cloud) The user could hand off files to each other instead of requiring the user to navigate a file system to transfer a file from one computer to another; much more intuitive.\n-Other users can see exactly what you’re watching when you’re watching it (if you want to expose it, if it is easily transferable via ad hoc networking\/bluetooth)\n-Provide additional information to real world objects (MIT Media Lab’s 6th sense project http:\/\/www.pranavmistry.com\/projects\/sixthsense\/index.htm) (need cameras or rfid)\n-Overlay an avatar onto yourself (or onto hands\/arms), so that if another was wearing the system, they would only see what you want them to see. (must be subscribed to same server, or allow ad-hoc communication) Only if viewing avatars is enabled.\n-Interact with tag ‘clouds’ or any type of 3d grouping system in a much more intuitive way, such as Mozilla’s Aurora http:\/\/adaptivepath.com\/aurora\/ (provide varying levels of resistance inside of the information-clouds)\n\nCommunication – how can this system be used to improve communication between individuals?\nImmediate, ubiquitous access to information (google, wikipedia), files stored on your hard drive, etc\n\nComplicated systems mapping. With the addition of a third dimension, complicated systems can be more easily mapped and displayed, without the high overhead costs currently holding back this form of communication.\nExample: This would probably be more understandable\/easier to map and conceptualize in 3D:\nhttp:\/\/www.expasy.ch\/cgi-bin\/show_thumbnails.pl\n\n\nProviding Content to users:\nServers running software provide the media and position information. Ads could be placed anywhere, providing the revenue for the server. The user would need to subscribe to the server, with an option for username and password, etc. A few default subscriptions would probably be provided. Movies, pictures, text, sound, 3d models, user positions, etc will be streamable.\nhttp:\/\/agoramedia.co.uk\/blog\/augmented-reality-ar\/ar3-0-augmented-reality-conceptual-framework\/\nThere will also be the local information that is required for one-to-one communication. This can either be provided through a server, or through ad-hoc connections. Perhaps even by a connection mesh.\nhttp:\/\/en.wikipedia.org\/wiki\/Mobile_ad-hoc_network\n\nmore in comments. 10000 character limit.","send_replies":true,"spoiler":false,"stickied":false,"subreddit":"augmentedreality","subreddit_id":"t5_2r2jj","subreddit_name_prefixed":"r\/augmentedreality","subreddit_type":"public","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Concept for AR: Wide-Area Augmented Reality with integrated haptics","url":"https:\/\/www.reddit.com\/r\/augmentedreality\/comments\/bq30x\/concept_for_ar_widearea_augmented_reality_with\/","whitelist_status":"all_ads"}],"metadata":{"op_a":64,"op_b":70,"total":134},"error":null}